["[2] \"INFORMATION BROCHURE Semester I, 2022-2023 for admission to Ph.D., M. Tech., M.S.(R), M.Des., M.P.P. and M.Sc.* Programmes (For Indian Applicants) * For M.Sc. (Cognitive Science). Admission to other M.Sc. programmes is on the basis of JAM. updated on 12th April 2022  Contents 1. MESSAGE TO THE APPLICANTS FROM THE DEAN, ACADEMICS 1 2. IMPORTANT DATES 4 3. INTRODUCTION 6 4. CREDIT SYSTEM 7 5. ADMISSION PROCEDURES AND REQUIREMENTS 8 - 21 A. Ph.D. Programmes 8 B. M.Tech. / M.S. (Research) / M. Des. Programmes 13 C. M.Sc. Programmes (Cognitive Science) 18 D. Master Of Public Policy 20 6. RESERVATION OF SEATS 22 7. REGISTRATION FOR COURSES 23 8. HOSTEL ACCOMMODATION 23 9. FEES AND PAYMENTS 24-25 A. Institute dues payable by new students of Ph.D./M.Tech./M.S.(R) /M.Des./MPP/M.Sc. 24 B. Mess dues payable by new students 25 10. FINANCIAL ASSISTANCE AND OTHER SUPPORT 26 11. GENERAL GUIDELINES 30 12. APPLICATION PROCEDURE\"", "[3] \"32 13. REFUND OF FEES 32 14. IMPORTANT INSTRUCTIONS FOR FILLING APPLICATION FORM 33 15. CONTACT TELEPHONE/FAX NUMBERS 34 16. ANNEXURES 36-67 A. A-I: Research Programmes: Doctor of Philosophy (Ph.D.) 36 B. A-II: Research Programmes: Master of Science (Research) 55 C. A-III: Options for M. Tech., M.S. (Research) & M. Des. Programmes according 59 to the discipline in which the candidate holds the Qualifying Degree D. A-IV: GATE Score cut-off for admission to non-sponsored full-time M.Tech. 65 Programmes in the previous Academic Year 17. ADDITIONAL IMPORTANT INFORMATION FOR CANDIDATES 68  P a g e | 1 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI MESSAGE TO THE APPLICANTS FROM THE DEAN, ACADEMICS I am very happy to note that you are planning to pursue your postgraduate education, and in particular you are considering IIT Delhi as one of your choices. India\"", "[3] \"is fast emerging as a knowledge economy and in the next decade or so, we would emerge as a major centre for research and technology development. In this context, your decision to pursue post-graduate education would definitely have a significant impact on your long-term career prospects. IIT Delhi with its 31 Ph.D., 41 M.Tech., 16 M.S.(R), 5 M.Sc., 3 M.B.A., one M.P.P. and one M.Des. Programmes, offers you extensive choices of specializations. The strength of the Institute is its 600+ highly qualified faculty, due to which it is continuously ranked among the top technical institutions globally. As you may be aware, IIT Delhi is recognized as an Institution of Eminence (IoE) by the Government of India. While this is a great recognition, it is also a great responsibility on all of us and indeed our prospective PG students, to take this Institution to even greater heights. We would like you\"", "[3] \"to consider joining us in this journey. At the time of writing this letter, we are opening up the campus after two years of restricted activity and online classes due to the pandemic. We hope that the future semesters will be person, and the campus is gearing up to welcome all students: new students and currently registered students, to learn and enjoy the experience of the IIT Delhi campus. That said, as we open up, it is extremely important to adhere to Covid-appropriate behavior and whatever restrictions that will need to be in place for the coming few semesters. In the last few years, we have constantly been working towards making our rules, regulations, and policies governing post-graduate education flexible and attractive to potential candidates. I am writing this letter to make you aware of some major policy changes in the last couple of years. 1. At IIT Delhi, most\"", "[3] \"of the academic Departments/ Centres/ Schools offer M. Tech. and Ph.D. programmes, while some of them also offer an M.S.(R) programme. It is possible for a student to switch from one programme to another any time after one semester of joining. For example, a candidate joining an M. Tech. programme can apply for the switch to a Ph. D. programme in the same Department (or even in another eligible Department), after completing 12 credits of courses with a minimum CGPA of 8.0. All his/her earned credits, if relevant to the new programme, can be considered in the new programme as well. Similar flexibility exists for switching between other programmes. 2. In the last year, IIT Delhi has initiated sponsored research activities worth around Rs. 350 crores which are expected to grow further this year. Candidates wanting to gain project experience along with post-graduate education can apply and join one of\"", "[4] \"the sponsored projects simultaneously with admission to the post-graduate degree. Apart from gaining experience, various schemes may provide for higher assistantship amounts with your participation in the sponsored research projects. One significant policy change that has been adopted is that the recruitment for the project can also be carried out by the same Department/ Center/ School Research Committee (DRC/CRC/SRC) that admits students to the postgraduate programmes.  P a g e | 2 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI 3. IIT Delhi is striving towards ensuring that each of its Ph.D. students has an opportunity to present a paper and attend at least one international conference before they graduate. We offer a certain quantum of financial support to all full-time research scholars to present their research at up to two international conferences. 4. We have also introduced a new scheme\"", "[4] \"under which highly meritorious research scholars are awarded a further opportunity for presenting their work at another conference, provided they have demonstrated sustained excellence in their research. 5. Our post-graduate programmes are highly flexible, which offer students a variety of courses and research topics to choose from. 6. Meritorious students with a bachelor’s degree (such as B. Tech.) are advised to directly apply for the Ph. D. programmes if they wish to pursue doctoral research. Details about direct admission to Ph. D. for B. Tech- qualified students are available in this brochure and also on our website. Of course, students who already hold a Master’s degree are welcome to apply for Ph.D. 7. IIT Delhi is actively promoting post-graduate research in inter-disciplinary areas, and you are invited to avail of this exciting opportunity. In addition to such research being pursued in our regular Academic Units, we also have a School\"", "[4] \"of Interdisciplinary Research (SIRe) wherein candidates with a diversity of backgrounds seek admission to pursue a Ph.D. degree involving faculty supervisors in different Academic Units and expertise, jointly supervising the student. Please look for more details on inter-disciplinary research on our website. 8. IIT Delhi, as a part of its Institution of Eminence (IoE) initiatives, is moving rapidly to welcome meritorious candidates for pursuing Ph.D. from other countries. As part of this, International students wanting to pursue PhD degree at IIT Delhi (who are not availing a scholarship from any other source) are entitled to a merit-based fellowship under the International PhD Fellowship Programme (IPFP). More information on this scheme and other details for international students are available at: http://intladm.iitd.ac.in 9. From Academic Year 2020-21, IIT Delhi has also started a new scholarship scheme for international students wishing to pursue M. Tech. / M. Des. / MS(R), under the newly\"", "[5] \"launched “International Masters Scholarship Programme (IMSP)”. Under this scheme, international students wishing to pursue either of M. Tech., M. Des., or MS(R) degrees in IIT Delhi, and secure an admission offer from the respective Department or Centre or School within IIT Delhi, are entitled to be considered for a limited number of merit-based scholarships. Those international students who have successfully cleared the Graduate Aptitude Test in Engineering (GATE examination: http://gate.iitd.ac.in/) are also entitled to a scholarship for pursuing their masters degree in IIT Delhi. More details of on the IMSP scheme are available at: http://intladm.iitd.ac.in 10. IIT Delhi is an active participant in two flagship MHRD schemes: the Prime Minister’s Research Fellowship (https://pmrf.in/) and the Scheme for students in ASEAN countries to pursue PhD in IITs (http://asean.iitd.ac.in/). The latter scheme entitles students from ASEAN countries (https://asean.org/asean/asean-member-states/) to pursue PhD with a  P a g e | 3 INFORMATION BROCHURE\"", "[5] \"for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI full scholarship at any of the IITs, including IIT Delhi. Potential PhD candidates from the ASEAN member countries interested in pursuing their PhD degree in IIT Delhi are strongly encouraged to avail this facility. 11. Under the PMRF scheme (https://pmrf.in/), Indian students of high merit from who have completed their bachelors degree, or pursuing their masters or PhD degrees in top Indian institutions may be considered for a merit-based premier scholarship. Potential candidates are encouraged to apply under this scheme, and seek details at the website. There is also a “lateral entry” option into PMRF for students who join the PhD program and demonstrate academic excellence within the first few semesters of their residence in the PhD program. 12. IIT Delhi is also an active participant in the Prime Minister's Fellowship for Doctoral Research, which is\"", "[5] \"a joint venture between SERB and CII / FICCI for supporting industry- sponsored PhD projects. Research scholars who get engaged in industry-sponsored projects are advised to apply for this scheme. 13. At IIT Delhi, we are engaged in two Joint Ph.D. programmes, one with University of Queensland, Australia (www.uqidar.org), and other with National Yang Ming Chiao Tung University, Taiwan (www.ncyu.edu.tw). While for the UQ-IITD programme, the admission is through a separate channel (details on the website: www.uqidar.org), for NYCU the entrance is after the selection of students into the regular IITD Ph.D.programme. You may wish to note that IIT Delhi has a larger number of students in post-graduate programmes than in undergraduate programmes. We urge you to consider us as your institution of choice to further your goals of getting a higher professional degree. One point needs some mention. Owing to our rapid growth in recent years and also delayed\"", "[5] \"construction activity owing to the Covid-19 pandemic, we are facing acute shortage of campus accommodation (hostels). Due to this, some of our PG students may need to stay outside campus, at least in the initial period of their study. IIT Delhi will do everything possible to facilitate the stay outside campus (if necessary). We expect the crunch of hostel accommodation to ease out in the coming years, but for now we as a community need to live with the constraints. There are many more things I would like to share with you once you are selected to our PG programmes and wish to join IIT Delhi. I am looking forward to seeing you in the Orientation Programme with you being accepted for admission in one of your preferred postgraduate programmes. Please note that in view of the evolving situation related to the COVID-19 outbreak, the dates may change. Hence, please\"", "[7] \"keep checking for updates on the IIT Delhi website. With best wishes, Prof. Shantanu Roy Dean, Academics  P a g e | 4 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI IMPORTANT DATES * Revised dates Submission of Online Application Commences on March 14, 2022 (12:00 noon) Last Date for Submission of Online Application and Application Fee April 17, 2022 (04:00 pm) Range of Dates for Test / Interview* May 2– June 24, 2022 Online Document Submission by New PG students July 11 - July 31, 2022 Date of Orientation and Registration (in person) for New Students August 1- August 2 2022 Commencement of Classes August 3, 2022  P a g e | 5 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI INTRODUCTION Indian Institute of Technology Delhi is one of the\"", "[7] \"seven older established Institutes of Technology in India, the others being Kharagpur, Bombay, Madras, Kanpur, Guwahati, and Roorkee. Recently, Government has set up sixteen more Institutes of Technology. These Institutes have been created as centres of excellence for higher training, research and development in science, engineering, and technology. Established as a College of Engineering in 1961, the Institute in Delhi was declared an Institute of National Importance under the “Institutes of Technology (Amendment) Act, 1963” and renamed “Indian Institute of Technology Delhi”. It was then accorded the status of a University with powers to decide its own academic policy, to conduct its own examinations, and to award its own degrees. Recently, IIT Delhi has been accorded the status of “Institute of Eminence” by Government of India, one out of only three public institutions to have been granted this honour. The Institute offers undergraduate and postgraduate programmes through its Departments, Centres,\"", "[8] \"and Schools. The Institute admits about 1200 students for the undergraduate (B. Tech. and Dual Degree) programmes and about 2200 students for the postgraduate (M.Sc. / M.P.P. / M.Tech. / M.S.(Research) / M.Des. /M.B.A. / Ph.D.) programmes every year.  P a g e | 6 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Intellectual alertness, creativity and talent for innovation go into the making of an engineering leader today and continue to be essential for professional competence tomorrow. The candidates selected for admission live in pleasant surroundings of intellectually stimulating campus, use the most modern equipment and laboratory facilities available, and go through the specialized courses designed to meet the challenges of the future. The teaching methods rely on direct personal contact between the teachers and the students. Living in such an environment with people having similar goals and aspirations is\"", "[8] \"an exciting experience during one’s academic life and is of considerable value in one’s professional career. Location: IIT Delhi is situated at Hauz Khas in South Delhi, bounded by the Sri Aurobindo Marg on the East, the Jawaharlal Nehru University complex on the West, the National Council of Educational Research & Training on the South, and the outer Ring Road to the North. The Institute campus is about 19 km away from the Delhi Main Railway Station, 14 km from the New Delhi Railway Station, 21 km from the Maharana Pratap Inter-State Bus Terminus (Kashmere Gate), 22 km from Indira Gandhi International Airport Terminal 3, and about 10 km from the domestic terminal (Terminal 1) of the Delhi Airport. The campus is well connected through Delhi Metro with two stations opening at its gates – Main Gate and Hostel Gate. Campus: IIT Delhi is a residential Institution and provides residential\"", "[8] \"facilities to as many students and staff as possible, subject to availability. The Institute campus area extends to 320 acres with many interesting topographical features, imaginatively laid out with picturesque landscape, numerous buildings, and wide roads. The campus presents a spectacle of harmony in architecture and natural beauty. The main academic building houses various teaching, research, and library facilities. Though each Department/Centre/School is a separate entity, all the Departments/Centres/Schools together constitute an integrated complex. Most of classes at IIT Delhi take place in the new Lecture Hall Complex (LHC). At the LHC and also in the blocks, lecture theaters with modern amenities and equipment for projection have been located adjacent to two or more Departments for common use. The campus also provides such amenities as staff clubs, hospital, shopping centres, banks, ATMs, post office, community centre, stadium and playing fields. The Students Activities Centre provides facilities for students’ extracurricular and\"", "[9] \"physical development. The central two-storeyed block with a swimming pool and a gymnasium hall has amenities such as squash courts, hobbies workshop, seminar rooms, music rooms and other multipurpose rooms for reading and indoor games. The amphitheater constructed in modern style is an added amenity at the centre.  P a g e | 7 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI CREDIT SYSTEM Education at the Institute is organized around the credit system of study. The prominent features of the credit system are a process of continuous evaluation of a student’s performance, and flexibility to allow a student to progress at an optimum pace suited to his/her ability or convenience, subject to fulfilling the minimum requirement for continuation. Each course has a certain number of credits which describe its weight. A student’s performance in a course is assessed by a\"", "[9] \"grade awarded to him/her at the end of the semester for that specific course, based on comprehensive evaluations during the entire duration of the course. The student’s overall progress through the programme is measured by the number of credits that he/she has completed satisfactorily. A minimum Grade Point Average (average score based on grades obtained, weighted by the corresponding credits of each course), is required to be maintained for satisfactory progress. The minimum academic requirements for the various degrees, including minimum and maximum credits to be registered in a particular semester, are indicated in the Courses of Study for the year 2022-2023, which will be made available on the Institute Website before the date of Orientation. Every course is coordinated by a member of the teaching staff of the Department/ Centre/ School which offers the course in a given semester. This Faculty member is called the Course Coordinator. He/she has\"", "[10] \"full responsibility for conducting the course, coordinating the work of the other members of the faculty involved in that course, and for holding tests and assignments and awarding grades. For any difficulty, a student is expected to approach the Course Co-coordinator for advice and clarification. Education at the Institute is organized around the credit system of study. The prominent features of the credit system are a process of continuous evaluation of a student’s performance, and flexibility to allow a student to progress at an optimum pace suited to his/her ability or convenience subject to fulfilling minimum requirement for continuation.  P a g e | 8 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI ADMISSION PROCEDURES AND REQUIREMENTS I. Ph.D. Programmes The award of the Ph.D. degree is in recognition of high achievements, independent research, and application of scientific knowledge to the\"", "[10] \"solution of technical and scientific problems. The creative and productive inquiry is the basic concept underlying the research work. The details of research programmes in various Departments/ Centres/ Schools are given in Annexure I. Course Work and other Academic Requirements: In order to overcome any deficiency both in the breadth and depth of fundamental training or proper foundation for advanced research work, special make-up or pre- doctoral courses are offered by each Department/ Centre/ School. These courses are given either by a faculty member, or by guest speakers and specialists in the profession. Normally, candidates having a B. Tech./ M.Sc./ M.A., or equivalent degree are required to complete a minimum of 12 or 20* credits (depending on the programme) with a minimum required DGPA of 7.50 and CGPA of 7.00. M. Tech. or equivalent degree holders are required to complete a minimum of 6* credits with a minimum required DGPA\"", "[10] \"of 7.50 and CGPA of 7.00. Admission to the Ph.D. Programmes: Admission to the Ph.D. programmes is normally made on the basis of an interview of eligible candidates conducted by the Department/Centre/School concerned, through its Department Research Committee (DRC) / Centre Research Committee (CRC)/ School Research Committee (SRC). DRC/CRC/SRC may decide to conduct a written test as well, or multiple interviews, or other ways or testing, in order to screen the candidates. Applications are invited from candidates by advertising the programmes in Employment News/web portals in March for the first semester and in October for the second semester every year. In view of ongoing CoViD-19 pandemic, it has been decided by the Senate that the conduct of interviews for admission to Ph.D. programme will be done online through videoconferencing. Admission Schedule: Normally, Ph.D. programmes are advertised in the month of March and October each year, and test/interviews are carried out\"", "[11] \"in the months of May and December. Further, admission to the Ph.D. programme is possible at any time of the year with the application being processed and candidates interviewed by the respective DRC/CRC/SRC. Ph.D. scholars can join the Institute at any time of the year, though the course registration will be possible only at the beginning of the subsequent semester. Such candidates must also fulfill the required academic qualification / experience at the time of the interview. They must join the Institute within 4 weeks after the issue of admission offer unless specifically permitted otherwise. Admission is subject to the vacancy being available in the relevant specializations. * A Department/ Centre/ School may specify a higher credit requirement for all their Ph.D. programmes. It may also require an individual scholar to complete a larger number of credits based on his/her background and preparation level.  P a g e |\"", "[11] \"9 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Duration of the Programmes: Minimum period of registration required for students with M.Tech. or equivalent qualifications is 2 years whereas those with B. Tech. or equivalent qualifications is 3 years. All candidates are allowed a maximum of 7 years for submission of their thesis. I(a) Minimum Qualifications for admission to Full-time Ph.D. Programmes: Table 1 defines the minimum qualifications required for admission to full-time Ph. D. programmes at IIT Delhi. Please note: 1. These are Institute minimum requirements and any Department/Centre/School operating through their DRC/CRC/SRC can specify higher short-listing criteria than what is specified here. 2. This table includes most of the degrees, but each DRC/CRC/SRC is free to specify the qualifications and disciplines acceptable for admission to their programmes. 3. Candidates in the final year of their programmes and who expect to\"", "[11] \"complete all their qualifying degree requirements before the date of registration are also eligible to apply for admissions. For short-listing purposes, their performance until the preceding semester (preceding year if their programmes are year based) would be considered but their admission would be provisional, subject to their meeting the minimum eligibility criteria after their final qualifying examination results are announced. In any case, all admissions are provisional at first and it is confirmed only after all certificates and previous records are duly checked and verified, a process which may take a few weeks into the starting semester. Table 1: Minimum Qualification for Admission to Full-time Ph.D. Programmes Sr. No. Qualifying Degree Minimum Performance in the Qualifying Degree for General/OBC (Non-Creamy Layer)/EWS Category Students Qualification Through National Level Examination Requirements 1. M.Tech./M.E./M.D./ M.Des. or equivalent 60% marks or 6.00 CGPA on a 10-point scale Nil 2. M.Sc./MBA/M.A./ M.B.B.S. or equivalent 60%\"", "[12] \"marks or 6.00 CGPA on a 10-point scale Qualified GATE/CSIR/ UGC NET/ICAR/ICMR/ DST-INSPIRE fellowship 3. B.E./B.Tech./B.Des. or equivalent 70% marks or 7.00 CGPA on a 10-point scale Qualified GATE/CSIR/ UGC NET/CEED/ICAR/DST INSPIRE Fellowship  P a g e | 10 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Exemptions, Relaxations and Clarifications: 1. For SC/ST/PwD category candidates, the minimum performance in the qualifying degree (S. No. 1 & 2 in Table 1) is relaxed from 60% to 55% (CGPA relaxed from 6.00 to 5.50). 2. For SC/ST/PwD category candidates, the minimum performance in the qualifying degree (Sr. No. 3 in Table 1) is relaxed from 70% to 65% (CGPA relaxed from 7.00 to 6.50). 3. Qualifying degree performance is computed by aggregating performance over all the semesters/years of the qualifying degree, as per the credit or weightage system approved in the institution\"", "[12] \"/ board where the degree has been completed. 4. Requirement of qualification in GATE / National Exam is waived for the following categories of applicants:  Currently registered students in Centrally Funded Technical Institutes (CFTIs) pursuing B. Tech./B.E./ Integrated M. Tech/ Integrated M. Sc. Programmes (or any other programme of minimum four-year duration, admission to which is on the basis of JEE), who have completed 6 semesters or more, and have CGPA of 8.00 or above (on a 10 point scale). Such students must obtain a CGPA of 8.00 or above at the time of graduation, and before they formally register for the Ph.D. programme (80% aggregate marks, if marks are the primary mode of evaluation);  Graduates of CFTIs (in the programmes marked under (i)) with a final graduation CGPA of more than 8.00 (80% aggregate marks, if marks are the primary mode of evaluation);  M.A. or M.Sc.\"", "[13] \"graduates from IITs with CGPA 8.000 or above. 5. Purposes of shortlisting, the primary method of evaluation (i.e., CGPA/CPI, or aggregate percentage, whichever is appropriate) followed by the institution where candidate has obtained his/her qualifying degree will be used by IIT Delhi for determining whether the candidate meets the final shortlisting requirements. 6. For assistantship purposes only (and not for qualification), candidates with M.B.B.S. qualification will be considered equivalent to M. Tech., for admission to Ph.D. programme in Centre for Biomedical Engineering; 7. For candidates with M.A. degree in English, a 5% relaxation in marks or 0.5 relaxation in CGPA may be permitted for admission to the Ph.D. programme in Humanities and Social Sciences; 8. Candidates holding an MBA degree are eligible for applying to the Ph.D. programme in the Department of Management Studies.  P a g e | 11 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and\"", "[13] \"M.Sc. Admissions Sem II l IIT DELHI I(b) Minimum Qualifications for Admission to Part-time and Sponsored (full-time) Ph.D. Programmes: The following eligibility conditions apply for the Part-time and sponsored full-time programmes: 1. Only employees of Public Sector Undertakings or Government Departments or Research and Development Organizations or Private Industries (approved by Faculty Boards) are eligible for admission to these programmes. 2. The minimum full-time experience required after obtaining the qualifying degree and as on date of registration, is given below in Table 2: Table 2: Experience Required for Admission to Part-time Ph.D./ M.Tech./ M.S.(R) Programmes For Admission to Part-time Programme Qualifications Work Experience (Post Qualification) Ph.D. M.E./M.Tech./M.S.(R)/M.D./M.Des. or equivalent Nil Ph.D. B.E./B.Tech. /M.Sc./M.A./M.B.A. /MBBS/ or equivalent, from CFTIs/Central Universities 1 Year Ph.D. B.E./B.Tech./M.Sc./M.A./M.B.A./MBBS or equivalent, and working in IIT Delhi* (Project or Regular) 1 Year Ph.D. B.E./B.Tech./M.Sc./M.A./MBA/MBBS or equivalent, from institutions other than CFTIs/Central Universities 2 Years M.Tech./ M.S.(R) B.E./B.Tech./M.Sc\"", "[14] \"or equivalent, from CFTIs/Central Universities 6 Months M.Tech./ M.S.(R) B.E./B.Tech./M.Sc or equivalent, and working in IIT Delhi* (Project or Regular) 6 Months M.Tech./ M.S.(R) B.E./B.Tech./M.Sc. or equivalent, from institutions other than CFTIs/ Central Universities) 1 Year * Through proper channel  P a g e | 12 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI 3. Minimum qualification for these candidates is the same as for full-time candidates (Table 1), except that the requirement of qualifying in a national examination (column 3 in Table 1) is waived. 4. For part-time candidates from outside NCR (or at a radial distance of more than 50 km from IIT Delhi), there is a minimum residency requirement of 6 months. DRC/CRC/SRC may specify a higher residency requirement based on the courses recommended as well as the background. 5. Sponsored (full-time) candidates seeking admission to a Ph.D.\"", "[14] \"programme on the basis of study leave, must submit a “Sponsorship Certificate” on a proper letterhead from the appropriate authority in the organization clearly stating the following:  for the period of his/her studies in the programme, the candidate would be treated as on duty with usual salary and allowances; and  that he/she will be fully relieved and granted study leave for a minimum period of 3 years (2 years for M. Tech. and equivalent degree holders). 6. Part-time candidates are required to submit a “No Objection Certificate” (NOC) on a proper letterhead from the appropriate authority in the organization clearly stating the following:  the candidate is permitted to pursue studies on a part-time basis;  he/she will be fully relieved from duty and permitted to reside at the Institute for the period of required residency that is essential for completing the course work (this is not a\"", "[15] \"requirement for candidates who are working in NCR or organizations located within a distance of 50 km from the Institute);  that his/her official duties permit him/her to attend required classes as per the Time Table of IIT Delhi;  that his/her official duties permit him/her to devote sufficient time for research;  facilities for research in the candidate’s field of research are available at the candidate’s place of work, in case the proposed Ph. D. research plan requires him/her to use these facilities when the candidate is physically present at this place of work. Template of this NOC is available on the IIT Delhi PG admissions website. Kindly note that lack of confirmation and clarity on one or more of the above points in the NOC may make prevent the applicant’s application being processed, even if he/she qualify in the interview/screening.  P a g e | 13 INFORMATION\"", "[15] \"BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI II. M. Tech./ M. S.(Research)/ M. Des. Programmes The Institute runs a number of M. Tech./ M. Tech (High-Value Assistantship) and M. S. (Research) programmes offered by various Departments, Centres, and Schools. M. Tech. and M.S.(R) programmes mainly differ in the fraction of course and project/thesis credits. M. Tech. programmes may have up to two- thirds of the credits for the course work, while M.S.(R) programmes have two-thirds of the credits for the thesis component. Some of these programmes are interdisciplinary programmes (IDP) where multiple academic units are involved. In these IDPs, students with different backgrounds are eligible to be admitted to the programme. IDPs are administered through a Programme Executive Committee or PEC. Master of Design (M. Des.) in Industrial Design is offered by the Department of Design. IIT Delhi also offers a number\"", "[15] \"of industry- sponsored programmes. In these programmes, either industry supports full-time students recruited by the Institute, or sponsors their employees for the programme. In either case, regular industry feedback is obtained to adopt and improve the curriculum to the needs of the industry. Industry sponsors also play a significant role in defining the projects. The listing of all the Masters' programmes is given in Annexure II. Flexibility of Movement: At IIT Delhi, easy mobility of students from M. Tech. to Ph.D., M. Tech. to M.S.(R), M.S.(R) to M. Tech. and M.S.(R) to Ph. D. is possible. It is possible for a student to join M. Tech./M.S. (R) at IIT Delhi, and subsequently they can apply for a change to a research programme if they feel confident. In this process, they save a considerable amount of time for completing Ph.D. degree. Further details are available in the Courses of Study booklet\"", "[15] \"available on the IIT Delhi website. Eligibility for Programmes: B. Tech. or M.Sc. degree holders of a particular discipline are eligible for admission to one or more programmes. The list of programmes to which a graduate of a specific discipline is eligible to apply, is given in Annexure III. Programme Duration: The minimum duration of M. Tech., M.S.(Research) and M. Des. programmes is 4 semesters (24 months) for full time and 6 semesters (36 months) for part-time programmes and M. Tech. (High Value Assistantship) programmes. Admission Schedule: Normally, M. Tech./ M. Tech. (High Value Assistantship)/ M.S.(R)/ M. Des. programmes are advertised in the month of March each year in Employment News as well as one electronic media and test/ interview are carried out in the month of May. M.S.(R) programmes are also advertised in the month of October followed by test/ interview in December. Further, just like Ph.D. admission, admission\"", "[16] \"to M.S.(R) programmes is also possible at any time in the year with the application being processed and candidates interviewed by the respective DRC/CRC/PEC. Students in this programme can be admitted to the Institute at any time of the year, though the course registration in such cases will be possible only at the beginning of the subsequent semester. Such candidates must also fulfill the required academic qualifications /experience at the time of interview. They must join the Institute within 4 weeks after the issue of admission offer unless specifically permitted otherwise. Admission is subject to vacancy being available in the relevant specializations.  P a g e | 14 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Part-time Programmes: IIT Delhi also offers most of its M.Tech. /M.S.(R) programmes in the part-time mode for working professionals. They are expected to complete their\"", "[16] \"credit requirements in six semesters (maximum of ten semesters) by registering for a lower load than full-time students each semester. Departments /Centres/Schools offer most of the core courses between 8:00 AM to 10:00 AM to enable these working professionals to attend classes as well as continue with their full-time employment. Please note it may not always be feasible to slot all courses of the programme in the above morning hours, and those candidates applying for part-time programmes should be flexible to take courses at other times, if required. II(a) Minimum Qualifications and Procedure for Admission to Full-time M. Tech./ M.S.(R)/ M. Des. Programmes: Table 3 lists the minimum qualifications required for admission to full-time M. Tech./ M.S.(R)/ M. Des. programmes at IIT Delhi. In this context, please note: 1. These are Institute minimum requirements and any Department/Centre/School operating through their DRC/CRC/SRC/PEC can specify higher short-listing criteria than what is specified\"", "[16] \"here. 2. This table includes many degrees for eligibility, but each DRC/CRC/SRC/PEC is free to specify the qualifying degree disciplines as well as GATE disciplines acceptable for admission to their programmes. 3. Admission to M. Tech./M. S.(R)/M. Des. programmes have been normally carried out in the past by first short-listing the eligible candidates (meeting the minimum performance in their qualifying degree - Column 4 of Table 3) and scoring above a GATE / CEED cut-off specified for that programme and then conducting written test / interview at IIT Delhi. GATE / CEED cut-offs for various Programmes last year are tabulated in Annexure IV. As approved by the Senate of IIT Delhi, M. Tech./ M.S. (R) selections for Academic Year 2022-23 will be done on the basis of GATE score and interviews (via videoconferencing) with applicable exemptions. However, an Academic Unit may decide to do the M. Tech./ M.S. (R) admissions\"", "[17] \"completely on the basis of GATE score, with the shortlisting criteria set at Institute minimum for all categories. This procedure is adopted by Senate only for Academic Year 2022-23 in view of the ongoing CoViD-19 pandemic, and the logistic and travel-related challenges that have been created by the current situation. However, M.Des. selections will be done on the basis of CEED score and interviews (via videoconferencing). 4. Candidates in the final year of their programmes and who expect to complete all their qualifying degree requirements before the third week of July 2022, are eligible to apply for admission. For short- listing purposes, their performance till the preceding semester (preceding year if their programmes are year based) would be considered, but their admission would be provisional, subject to their meeting the minimum eligibility criteria after their final qualifying examination results are announced.  P a g e | 15 INFORMATION BROCHURE\"", "[17] \"for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Table 3: Minimum Qualification for Admission to full-time M. Tech./M.S.(R)/M. Des. Programme Programme & Admission Type Qualifying Degree Minimum Performance in the Qualifying Degree for General/OBC (Non-creamy Layer) /EWS Category Students National Level Examination Requirements M. Tech./ M. Tech. (High Value Assistantship)/ M.S. (R) (Admission with GATE Score and interview)* B.E./B. Tech./ M.Sc. or equivalent 60% marks or 6.00 CGPA on a 10-point scale Valid GATE score M. Des. (Admission with CEED score and interview) B.E./B. Tech./ B.Des. or equivalent 60% marks or 6.00 CGPA on a 10- point scale Valid CEED Score Note: The interviews will be held online through videoconferencing. However, as decided by the Senate, the admission may also be done based on GATE score only, if any Academic Unit decides to do so. In such a case, the % age/ CGPA will\"", "[17] \"be kept at Institute minimum. Exemptions, Relaxations and Clarifications: 1. For SC/ST/PwD category students, minimum performance in the qualifying degree is relaxed from 60% to 55% (CGPA 6.00 to 5.50). 2. Qualifying degree performance is computed by aggregating performance over all the semesters/years of the qualifying degree). 3. The offer of admission to M.Tech. Programme will have to be accepted on the Common Offer Acceptance Portal (COAP). Detailed instructions in this regard will be provided on the IIT Delhi website. 4. Candidates with AMIE or Grad. IETE qualifications may also be considered for admission to the M. Tech. Programmes; however, if provisionally selected for admission based on their AMIE/Grad IETE performance, they would be required to complete 24 valid undergraduate credits prescribed by the concerned DRC/CRC/ SRC/PEC and clear the GATE examination before being actually admitted to the M. Tech./ M.S.(R)/M. Des. Programmes. 5. For admission to all the above\"", "[18] \"programmes, candidates with B.Tech. from IITs, graduating * The interviews will be held online through videoconferencing. However, as decided by the Senate, the admission may also be done based on GATE score only, if any Academic Unit decides to do so. In such a case, the % age/ CGPA will be kept at Institute minimum.  P a g e | 16 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI with a CGPA of 8.00 or above, are exempted from qualifying GATE/ CEED. If shortlisted, they will be interviewed through videoconferencing. 6. For admission to M.S.(R), requirement of qualification in GATE / National Exam is waived for the following categories of applicants:  Currently registered students in Centrally Funded Technical Institutes (CFTIs) having CGPA of 8.00 or above (on a 10 point scale) at the end of 6th semester or later, in\"", "[18] \"B. Tech./B.E./ Integrated M. Tech./ Integrated M. Sc. Programmes (or any other programme of minimum four year duration, admission to which is on the basis of JEE), the requirement of GATE / National Exam is waived for consideration of admission to the M.S. (R) programme in IIT Delhi. Moreover, such students must have obtained a CGPA of 8.00 or above at the time of graduation (and before they formally register for the M.S.(R) programme).  Graduates of CFTIs (in the programmes marked under (i)) with a final graduation CGPA of more than 8.00 (80% aggregate marks, if marks is the primary mode of evaluation);  M.A or M.Sc. graduates from IITs with CGPA 8.000 or above. However, if a candidate admitted to M.S.(R) programme following the above criterion wanted to convert to M.Tech. programme, he/she should also meet the shortlisting criteria of the M.Tech. programme, in addition to the conversion\"", "[18] \"criteria (including requirement, if any, of a valid examination in GATE / National Examination). 7. As approved by the Senate of IIT Delhi, M.Tech./ M.S. (R) selections for Academic Year 2022-23 will done on the basis of GATE score and interviews (via videoconferencing) with applicable exemptions. However, an Academic Unit may decide to do the M.Tech./ M.S. (R) admissions completely on the basis of GATE score, with the shortlisting criteria set at Institute minimum for all categories. This procedure is adopted by Senate only for Academic Year 2022-23 in view of the ongoing CoViD-19 pandemic, and the logistic and travel-related challenges that have been created by the current situation. M.Des. selections will be done on the basis of CEED score and interviews (via videoconferencing). II(b) Minimum Qualifications for Admission to Part-time and Sponsored (full-time) M. Tech./ M.S.(R) Programmes: The following additional eligibility conditions and relaxations apply for the Part-time and\"", "[19] \"sponsored full-time programmes: 1. Only employees of Public Sector Undertakings or Government Departments or Research and Development Organizations or Private Industries (approved by Faculty Boards) are eligible for admission to these programmes. 2. Employees of only those organizations which are located within 50 km radius of IIT Delhi are eligible to be considered for admission to part-time M.Tech./ M.S.(R) programmes.  P a g e | 17 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI 3. The minimum experience (Full Time) required after qualifying degree and as on date of registration is as given in Table 2 above. 4. Minimum qualification for these candidates is the same as for full-time candidates except that the requirement of qualifying in a national examination (Column 4 in Table 3) is waived off. All Part- time and Full-time Sponsored candidates will be interviewed through Videoconferencing, if\"", "[19] \"shortlisted. 5. Sponsored (full-time) candidates seeking admission to a M.Tech./M.S.(R) programme on the basis of study leave, must submit a “Sponsorship certificate” on a proper letterhead from the appropriate authority in the organization clearly stating the following:  for the period of his/her studies in the programme, the candidate would be treated as on duty with usual salary and allowances, and  that he/she will be fully relieved and granted study leave for a minimum period of 2 years 6. Part-time candidates are required to submit a “No Objection Certificate” on a proper letterhead from the appropriate authority in the organization clearly stating the following:  the candidate is permitted to pursue studies on a part-time basis  that his/her official duties permit him/her to devote sufficient time for studies  that he/she will not be transferred to any other place during the period of study. 7. Please note that\"", "[20] \"all part-time and sponsored candidates will have to go through an interview or selection process.  P a g e | 18 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI III. M.Sc. in Cognitive Science The Institute has introduced new programme, M.Sc. in Cognitive Science (two- year Full time), at the Department of Humanities and Social Sciences from July 2020. Eligibility for Programmes: Any Bachelor’s Degree or equivalent awarded by any of the universities incorporated by an act of the central or state legislature in India or other educational institutions established by an act of Parliament or declared to be deemed as a University under Section 3 of the UGC Act, 1956, or an equivalent qualification recognized by the Ministry of Education, Government of India, including Bachelor Degrees from universities/institutes located outside India, subject to the guidelines for admission of foreign students\"", "[20] \"as laid forth by the statute of IIT Delhi. The bachelor’s degree or equivalent qualification obtained by the candidate must entail a minimum of three years of education after completing higher secondary schooling (10+2) or equivalent. Programme Duration: The duration of M. Sc. programme is 4 semesters (24 months). Admission Schedule: The advertisement of M.Sc. in Cognitive Science programme will be via COGJET. Other exams like GATE, JAM etc. can be used in lieu of COGJET. In addition, IIT Delhi advertises this programme for call of applications in the month of March in employment news and electronic media. The admissions are carried out in the month of July. Minimum Qualifications and Procedure for Admission to Full-time M. Tech./ M.S.(R)/ M. Des. Programmes: Table 4 lists the minimum qualifications required for admission to full-time M.Sc. in Cognitive Science programme at IIT Delhi. In this context, please note: 1. These are Institute\"", "[21] \"minimum requirements, and the Department can specify higher short- listing criteria than what is specified here. 2. The admission to M.Sc. in Cognitive Science will be through a central national-level Joint Admission Test in Cognitive Science (COGJET). The candidates with a valid COGJET or other exams like GATE/NET/etc. (above a certain cut-off) will be invited to appear before an interview panel. 3. Candidates in the final year of their programmes and who expect to complete all their qualifying degree requirements before the third week of July 2022, are eligible to apply for admission. For short-listing purposes, their performance till the preceding semester (preceding year if their programmes are year based) would be considered, but their admission would be provisional, subject to their meeting the minimum eligibility criteria after their final qualifying examination results are announced.  P a g e | 19 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P.,\"", "[21] \"and M.Sc. Admissions Sem II l IIT DELHI Table 4: Minimum Qualification for Admission to M.Sc. in Cognitive Science Programme Programme & Admission Type Qualifying Degree Minimum Performance in the Qualifying Degree for General/OBC (Non-creamy Layer)/ EWS Category Students National Level Examination Requirements M.Sc. Cognitive Science (Admission with valid COGJET score and personal interview) Bachelor’s degree (B.A./B.Sc./B.Tech. /B.E. or equivalent) At least 55% or 5.5 CGPA on a 10-point scale Valid COGJET score Exemptions, Relaxations and Clarifications: 1. For SC/ST/PH category students’ minimum performance in the qualifying degree is relaxed from 55% to 50% (CGPA 5.5 to 5.00). 2. Qualifying degree performance is computed by aggregating performance over all the semesters/years of the qualifying degree. Taking into account all subjects including languages and subsidiaries, all years combined). 3. Applicants with valid JAM/GATE/CSIR/JRF/NET scores (where applicable) would be waived from COGJET. In addition, applicants from CFTIs with a minimum GPA of\"", "[22] \"8.0, B.Tech. from IITs graduating with a CGPA of 8.0 or above, and those with an MBBS degree from recognized institutions and universities are exempted from the COGJET/GATE/ JAM/CSIR/JRF/NET requirement. This will be subject to revision as decided by the academic section of IIT Delhi and will be as per rules. 4. Admission to the other existing M.Sc. programmes (Physics, Chemistry, Maths and Economics) is through Joint Admission Test for M.Sc. (JAM).  P a g e | 20 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI IV. Master of Public Policy The Institute has introduced new programme, Master of Public Policy (MPP) (two-year Full time) with focus on Science, Technology & Innovation (STI) and Development at the School of Public Policy from August 2021. Eligibility for Programmes: Qualifying degrees for the MPP programme are: five-year Bachelor’s degree such as MBBS, BA\"", "[22] \"LLB (Hon), B.Arch. or equivalent; four year Bachelor’s Degree such as B.Tech., BSc (Ag), BVSc, or equivalent; and post-graduate degrees such as MA, MSc, MPhil, Integrated MSc/MA, MTech or equivalent. Programme Duration: The duration of MPP programme is 4 semesters (24 months). Minimum Qualifications and Procedure for Admission to Full-time M.P.P Programmes: Table 5 lists the minimum qualifications required for admission to full-time MPP Programme at IIT Delhi. In this context, please note: 1. These are Institute minimum requirements, and the Department can specify higher short- listing criteria than what is specified here. 2. The admission to MPP programme will be through a two-tier admission process: performance in written/oral exam and performance in the interview. The written/oral examination will include evaluation of analytical abilities; quantitative skills; and reading, comprehension, and reasoning. 3. Candidates in the final year of their programmes and who expect to complete all their qualifying degree requirements\"", "[23] \"before the third week of July 2022, are eligible to apply for admission. For short-listing purposes, their performance till the preceding semester (preceding year, if the programmes are year based) would be considered, but their admission would be provisional, subject to their meeting the minimum eligibility criteria after their final qualifying examination results are announced.  P a g e | 21 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Table 5: Minimum Qualification for Admission to Master of Public Policy Programme Programme & Admission Type Qualifying Degree Minimum Performance in the Qualifying Degree for General/OBC (Non-creamy Layer) / EWS Category Students Master of Public Policy (With focus on Science, Technology & Innovation (STI) and Development) Admission with written/ oral exam and personal interview Five-year Bachelor’s degree such as MBBS, BA/LLB (Hon), B.Arch. or equivalent; four year Bachelor’s Degree such as B.Tech.,\"", "[24] \"BSc (Ag), BVSc, or equivalent; Postgraduate degrees such as MA, MSc, MPhil, Integrated MSc/MA, MTech or equivalent At least 60% or 6.0 CGPA on a 10-point scale. Exemptions, Relaxations and Clarifications: 1. For SC/ST/PwD category candidates, minimum performance in the qualifying degree is relaxed from 60% to 55% (CGPA 6.0 to 5.50). 2. Qualifying degree performance is computed by aggregating performance over all semesters/years of the qualifying degree. Taking into account all subjects including languages and subsidiaries, all years combined). For further details, please visit: https://spp.iitd.ac.in/academics  P a g e | 22 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI RESERVATIONS OF SEATS 1. 15% seats are reserved for SC and 7.5% for ST candidates. 2. 27% seats are reserved for Non-Creamy layer OBC candidates. All candidates applying for admission under this category should produce the OBC (Non-Creamy Layer) Certificate applicable\"", "[25] \"for OBCs in the Central list at the time of interview. For details and specimen form visit: http://www.iitd.ac.in. 3. 10% seats are reserved for EWS (Economically Weaker Section) candidates. 4. 5% seats in the respective categories are reserved for the Persons with Disability (PwD) in the Postgraduate courses and Ph.D. Programmes. Note: All shortlisted candidates applying for admission under the reserved categories are required to produce the relevant certificate at the time of interview. The Scheduled Tribe (ST) category candidates are required to produce ‘Validity Certificate’ along with the ST category certificate.  P a g e | 23 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI REGISTRATION FOR COURSES All students are required to report for Orientation and Central Registration before the commencement of each semester according to the schedule/procedure notified in advance. The students register themselves for the courses in\"", "[25] \"consultation with the Course Coordinator. The courses to be run by the Departments are made known to the students before registration. On admission, the students should go through carefully the Departmental advice of courses for their discipline. They should also go through the Prospectus as well as the Courses of Study regarding the rules governing their academic duties and performance. In some Departments, the required performance levels for the continuation of registration may be higher than those given in the Prospectus and the Courses of Study. The admitted students must acquire a copy of the departmental norms in such cases. HOSTEL ACCOMMODATION All post-graduate students admitted on a full-time basis may, subject to availability and hostel accommodation policy, avail of residential facilities in the hostels. The Institute has eleven boys’ hostels and two girls’ hostels. It may be noted that at present, there is a severe shortage of hostel accommodation\"", "[26] \"owing to renovation activities and an increase in student strength, and the Institute may not be in a position to offer hostel accommodation to all post-graduate students.  P a g e | 24 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI FEES AND PAYMENTS I. Institute Dues Payable by 2022 Entry Ph.D./ M.Tech./ M.S.(R)/ M.Des./ M.Sc. /M.P.P. Students Table 6: Schedule of Fee Applicable for Different Programmes Category Tuition Fees Other Charges Hostel Seat Rent* Total Amount M.Tech./M.S.(R)/MPP/M.Des. Students Receiving Institute/Project Assistantship or Teaching Positions Holders General/OBC/EWS 25000 28100 13250 66350 SC/ST/PwD 0 28100 13250 41350 M.Tech./M.S.(R)/MPP/M.Des. Students (Sponsored Full-time, Part-time and Non-teaching Position Holders) General/OBC/EWS 100000 25100 0 125100 SC/ST/PwD 0 25100 0 25100 All Full-time Ph.D. Students General/OBC/EWS 10000 26100 13250 49350 SC/ST/PwD 0 26100 13250 39350 All Sponsored /Part-time Ph.D. Students General/OBC/EWS 25000 25100 0 50100 SC/ST/PwD 0\"", "[27] \"25100 0 25100 M.Sc. Students General/OBC/EWS 10000 28100 13250 51350 SC/ST/PwD 0 28100 13250 41350 Note: SC/ST/PwD students are given 100% exemption from payment of tuition fee. The exact amount of fees and mode of payment will be indicated in the offer of admission. * Non-Hostelers/ Part Time Sponsored students need not pay the Hostel Seat Rent of Rs. 13250/- (for M.Tech./M.S.(R)/M.Des./ MPP/M.Sc. and Ph.D.) . Please note that admission and hostel allocation are delinked and Hostel Seat Rent is only to be paid if hostel is allotted..  P a g e | 25 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI II. Mess Dues Payable by 2022 Entry Students Membership of associated mess is compulsory only for those allotted Hostel accommodation. They will be required to pay Mess Dues at the time of joining as detailed in Table 7. Table\"", "[28] \"7: Mess Dues Applicable at the Time of Joining the Mess Details Boys & Girls Mess Security Deposit (refundable) Rs.15,000 Mess Admission (onetime payment) (Non-refundable) Rs.7,000 Mess Advance (onetime payment adjustable against mess dues) Rs.25,000 Total Rs.47,000  P a g e | 26 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI FINANCIAL ASSISTANCE AND OTHER SUPPORT I. Ph.D. Programmes A scheme for the award of Teaching/Research Assistantship for providing financial assistance to the students exists. In terms of this scheme, those non-sponsored students who are admitted on full-time basis are considered for the award of Teaching/Research Assistantship. These rates have been significantly enhanced by the MoE recently and are as indicated below: Table 8: Assistantship amounts for Full-time Institute Ph.D. students Period of Assistantship Assistantship Amount With B.Tech/B.E./M.Sc./ M.Tech./M.E./MBBS or equivalent qualifications Hours/ Week Assistantship to be Provided First 2 years\"", "[28] \"of Registration Rs. 31,000/- p.m. 8 Next 3 years of Registration Rs.35,000/- p.m. 8 Under the Prime Minister’s Research Fellowship (PMRF) Scheme, certain number of fellowships are allocated to the Institute. While PMRF fellows are governed by the same academic rules as any other research scholar, the selection of PMRF fellows is through a separate process approved by the National Coordination Committee (NCC) of PMRF. Please visit: https://pmrf.in for details. Other conditions and benefits: In addition, the full-time students enjoy a number of benefits but are also required to satisfy academic performance requirements for continuation of assistantship from semester to semester.  The maximum duration for which assistantship can be awarded to a Ph.D. student is 5 years.  In the first instance, the assistantship is awarded for one semester. Continuation of the assistantship during the subsequent semesters is contingent upon satisfactory academic performance and satisfactory performance in the discharge\"", "[29] \"of responsibilities assigned under the assistantship scheme. For this purpose, an SGPA of 7.00 at the end of a semester in respect of those semesters when the student has been assigned coursework will be considered as satisfactory performance. For details of SGPA calculation refer to the Institute Prospectus.  All full-time students participating in a sponsored project/consultancy project (in addition to their assistantship work) can be paid an honorarium of up to Rs. 25,000/- p.m. by the PI/CI of the project. All such work can be undertaken only with the consent of their supervisor(s).  The faculty of an Engineering/Science College sponsored by his/her institution for  P a g e | 27 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI pursuing Ph.D. at IIT Delhi and meeting all the academic requirements of full-time Institute assistantship can be considered by the DRC/CRC/SRC/PEC\"", "[29] \"for the award of Institute Assistantship. This assistantship would be over, and above the emoluments, he/she may be getting from his/her parent institution.  A part from Institute assistantship, IIT Delhi has a number of assistantships sponsored by national as well as international institutions and/or industries. All students including faculty of engineering/science colleges meeting the academic qualifications for admission as full-time students with Institute assistantship are also entitled to apply for these. For more information on the availability of such scholarships in your area, please contact your respective department/centre/school.  In exceptional cases with the approval of the Chairman, Senate, Sponsored (Fulltime) candidates employed in CSIR/DRDO/PSUs may also be offered assistantship provided they have qualified either GATE or any other national level examination like CSIR/UGC NET/ICAR etc. and fulfill the requirement for award of assistantship and their employer has no objection to the same.  Institute provides seed money of\"", "[29] \"Rs. 20,000/- once during the program as partial financial assistance for presenting papers abroad in good academic conferences. All full time (and part-time on IRD/ FITT Projects) Research Scholars are also eligible for additional financial assistance of Rs. 1,30,000/- as Research Scholar Travel Award (RSTA). Some highly meritorious Research Scholars are also eligible for an additional travel grant of Rs. 1,50,000/- as Research Excellence Travel Award (RETA).  Institute is in the process of formalizing a number of agreements with leading foreign institutions or agencies for supporting up to 6 months long research visits by Ph.D. students. This would enable interested students with the consent of their supervisor and DRC/CRC/SRC to undertake a research visit which would increase his/her exposure while adding value to his/her work.  It is expected that all assistantship holders will have the good general physique. He/ She will have to produce on the date of\"", "[30] \"Central Registration, a certificate to that effect in the prescribed format. A copy of the format would be given along with the admission offer letter. The admission is subject to his/her being found medically fit.  P a g e | 28 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI II. M. Tech./ M.S. (R) / M.Des. Students and M.Tech. (High-Value Assistantship) A scheme for the award of Teaching/Research Assistantship for providing financial assistance to the students exists. The present scheme is described below:  Students admitted to M.Tech./ M.S.(R) and M.Des. Programmes on full-time basis are considered for the award of Teaching Assistantship under which they will be paid Rs.12,400/- per month and would be required to provide assistance of 8 hours/week to the Department/Centre/School.  Only full-time non-sponsored students who have qualified GATE/CEED are eligible for assistantship  The maximum\"", "[30] \"duration for which Assistantship can be awarded to M.Tech./ M.S.(R )/ M.Des. students is 4 semesters.  Students admitted to M Tech. (High Value Assistantship) Programmes basis are considered for the award of High Value Assistantship under which they will be paid Rs. 22,000/- per month and would be required to provide assistance of 20 hours/week to the Department/Centre/ School.  The maximum duration for which Assistantship can be awarded to M. Tech. (High Value Assistantship) students is 6 semesters.  In the first instance, the assistantship is awarded only for one semester. Thereafter, continuation of the assistantship during each semester is contingent upon satisfactory academic performance and satisfactory performance in the discharge of responsibilities assigned under the assistantship scheme. For this purpose an SGPA of not less than 7.00 (6.75 in the case of SC/ST/PwD) at the end of the semester is treated as satisfactory academic performance.  All\"", "[31] \"full-time M.Tech./M.S.(R)/M.Des. students participating in a sponsored project/ consultancy project (in addition to their assistantship work) can be paid an honorarium of upto Rs. 3,000/- p.m. by the PI/CI of the project. All such work can be undertaken only with the consent of their supervisor(s).  Candidates qualified for CSIR JRF will not be allowed to avail fellowship for doing M.Tech./M.S.(R) programmes. However, they can avail the CSIR fellowship for doing the Ph.D. programme.  Apart from the above-mentioned scheme for teaching/research assistantships, there are a number of fellowships/scholarships instituted by Industries/Individuals. (For more information on these scholarships/ assistantships/fellowships please contact the respective department).  A number of DAAD scholarships under the Sandwich System may be available. Indian Students pursuing M.Tech. at IIT Delhi are eligible for this scholarship for doing their thesis work for about 6 months at one of the nine German Technical Universities (TU9).  P a\"", "[31] \"g e | 29 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI  Institute is pursuing a number of other collaborative agreements with leading research laboratories an universities to enable such research visits by post-graduate students  It is expected that all assistantship holders will have good general physique. He/she will have to produce on the date of Central Registration, a certificate to that effect in the prescribed format. A copy of the format would be given along with the admission offer letter. The admission is subject to his/her being found medically fit. III. MPP/ M.Sc. Programme A scheme for the award of Teaching/Research Assistantship for providing financial assistance to the students exists. The present scheme is described below:  Merit-cum-Means (MCM) Scholarship – Merit-cum-Means scholarship of Rs. 1,000/- per month and tuition fee waiver are permissible to M.Sc. students to the\"", "[32] \"extent of 25% of the sanctioned strength as per Institute rules. Only those students are eligible whose parents’ gross income is upto Rs. 4.5 lac per annum for all categories of students / as per govt. orders as applicable.  Freeship – Tuition Fee Waiver to the students whose annual family income is upto 4.5 lac (awarded up to 10% of the students admitted.  Free Messing – SC/ST students with Parental Annual Income upto 4.5 lac are provided Free-Messing.  P a g e | 30 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI GENERAL GUIDELINES (a) The minimum eligibility criteria indicated above for each programme is only an enabling clause. The Deptt./Centre/School may fix higher criteria at the time of short listing keeping in view the number of candidates, minimum background expected to cope with the programme etc. (b) The\"", "[32] \"Senate of the Institute may change the selection criteria/selection method in view of prevailing COVID situation in the country. In case of such a change, it will be updated in the Information Brochure and/or will be notified on the website of the Institute. (c) The minimum prescribed marks in aggregate (of all the years/semesters of the qualifying examination) is calculated by IIT Delhi as per example given below: Years 1st Semester (%) IInd Semester (%) 1st year 250/400 62.50 290/400 72.50 IInd Year 205/400 51.25 280/400 70.00 IIIrd Year 210/400 52.50 350/400 87.50 IVth Year 240/400 60.00 150/200 75.00 Total 905/1600 1070/1400 Aggregate (% age) 1975/3000=65.83% (of all the years/semesters) (d) Admission on a part-time basis is further subject to the availability of seats for part-time and decision of the respective DRC/CRC/SRC/PEC (e) Candidates who are in the final year of their qualifying examination can be considered for admission only\"", "[32] \"if they complete the requirement of their final examination including Viva- Voce by the date of Registration given on page 5. Candidates must inform Academics (P.G.) Section, IIT Delhi in writing by the date of Registration, if the requirements of their qualifying degree including Viva-Voce, if any, are not met by this date. Failure to inform the Academics (P.G.) Section about non- completion shall result in forfeiture of entire fees deposited by them in addition to cancellation of their admissions. (f) The applications will be scrutinized by the Department/Centre/School concerned. (g) As approved by the Senate of IIT Delhi, M.Tech./ M.S. (R) selections for Academic Year 2022-23 will done on the basis of GATE score and interviews (via videoconferencing) with applicable exemptions. However, an Academic Unit may decide to do the M.Tech./ M.S. (R) admissions completely on the basis of GATE score, with the shortlisting criteria set at Institute minimum\"", "[33] \"for all categories. This procedure is adopted by Senate only for Academic Year 2022-23 in view of the ongoing CoViD-19 pandemic, and the logistic and travel-related challenges that have been created by the current situation. M.Des. selections will be done on the basis of CEED score and interviews (via videoconferencing).  P a g e | 31 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI (h) The exact date for the online interview, wherever applicable, will be communicated by the Department/Centre/School. For any query regarding the date of interview, selection result and operation of waiting list please contact the concerned Deptt./Centre/School at the Telephone Nos. given on page 34 of this brochure. (i) Application incomplete, in any respect, is liable to be rejected. (j) A provisional list of applicants selected for admission and of applicants selected for the award of Assistantship along\"", "[34] \"with those placed on waiting will be displayed on the Department/Centre/School notice board /website within a day of the test/interview. The selected candidates would be required to pay the first installment of fees soon after the admission offer letter is issued to the candidates failing which seats will be offered to those on the waiting list.  P a g e | 32 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI APPLICATION PROCEDURE Submission of Application is only through online procedure. Candidates are NOT required to send hard copy of the application form and bank challan. Online submission of the application form may be made by accessing the Institute website: https://home.iitd.ac.in/pg-admissions.php. Candidates belonging to General/OBC/EWS category are required to pay for each application form a fee of Rs. 200/- and the candidates belonging to SC/ST/PwD categories are required to pay Rs. 50/-.\"", "[35] \"The bank charges will be borne by the candidate. The application fees is non-refundable. REFUND OF FEES The whole amount of fees/other charges deposited by the candidates will be refundable after deduction of Rs.1,000/- if the candidates do not join the programme after paying the dues and leave the Institute by applying for refund on or before the date of registration. On resignation after registration, only security deposit will be refunded. For refund of fees and/or security deposit the student must apply on the prescribed form available on the Institute Website: https://owncloud.iitd.ac.in/nextcloud/index.php/s/GGcGtRew625jRkW  P a g e | 33 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI IMPORTANT INSTRUCTIONS FOR FILLING APPLICATION FORM (a) Separate application form should be filled for Ph.D. programme for each Department/Centre/School. (b) Separate application form should be filled for each M.S.(R) programme. (c) Separate application form should\"", "[35] \"be filled for M.Des. programme. (d) Separate application form should be filled for M.P.P. programme. (e) Separate application form should be filled for M.Sc. (Cognitive Science) programme. (f) Separate application form should be filled for each M.Tech. programme (except Mechanical and Physics Departments). In case of M.Tech. programme in Mechanical Department and Physics Department, a candidate may fill single form for each Department and give choices in order of preference for the M.Tech. Programmes available in that Department. However, he/she will be considered only for two choices for which he/she is eligible in the order of preference given. (g) For the GATE qualified candidates applying for full-time M.Tech. Programme, the offer for admission, if selected, will be through Common Offer Acceptance Portal (COAP). Such candidates must register on COAP portal before applying and mention COAP Registration No. in the application form. (h) GATE score cut off criteria used for short-listing\"", "[36] \"candidates in different non-sponsored (full- time) M.Tech. programmes during the previous academic year is given in Annexure IV. This is only for the candidate’s reference and the criteria may even change substantially based on applications received for the current admissions. (i) Part-time/Sponsored (full-time) candidates must submit NOC/Sponsorship Certificate from their employer at the time of interview. (j) Filling of false information will lead to rejection of application/cancellation of admission. (k) The application fee is not refundable in any case. Fill the programme code at the appropriate place in the Application Form. The Ph.D. programme codes are given in Annexure-I and M.S.(R) programme codes are given in Annexure-II. If you find any difficulty in completing your application, please see Frequently Asked Questions (FAQ) on the following link: https://owncloud.iitd.ac.in/nextcloud/index.php/s/EJsLYkm5MtPmeDJ.  P a g e | 34 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI\"", "[36] \"CONTACT TELEPHONE NOS. 1. For any query/clarification, please contact Academic Section at the following telephone Nos.: 011-26597258, 011-26591743 or write to admissions@admin.iitd.ac.in (preferred). 2. For query regarding the date of interview, selection result and operation of waiting list, please contact the concerned Deptt./Centre/School at the following Emails IDs (preferred) or Telephone Numbers (prefix area code 011 if calling from within India, and country code/ area code 0091/11 if calling from outside India): ACADEMIC UNITS TELEPHONE EMAIL-ID DEPARTMENTS Applied Mechanics 26591201 hodam@admin.iitd.ac.in Biochemical Engineering and Biotechnology 26591001 hoddbeb@admin.iitd.ac.in Chemical Engineering 26591021 hodchemical@admin.iitd.ac.in Chemistry 26591501 hodchemistry@admin.iitd.ac.in Civil Engineering 26596422 hodcivil@admin.iitd.ac.in Computer Science and Engineering 26591291 hodcse@admin.iitd.ac.in Design 26591431 hoddod@admin.iitd.ac.in Electrical Engineering 26591071 hodee@admin.iitd.ac.in Energy Science and Engineering 26591251 hodces@admin.iitd.ac.in Humanities and Social Sciences 26591371 hodhss@admin.iitd.ac.in Management Studies 26591171 hoddms@admin.iitd.ac.in Mathematics 26591471 hodmaths@admin.iitd.ac.in Materials Science and Engineering 26596659 hodmse@admin.iitd.ac.in Mechanical Engineering 26591051 hodmech@admin.iitd.ac.in Physics 26591331 hodphysics@admin.iitd.ac.in Textile and Fibre Engineering 26591401 hodtextile@admin.iitd.ac.in CENTRES\"", "[37] \"Applied Research in Electronics 26591101 hodcare@admin.iitd.ac.in Atmospheric Sciences 26591301 hodcas@admin.iitd.ac.in  P a g e | 35 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Automotive Research and Tribology 26591281 hodcart@admin.iitd.ac.in Biomedical Engineering 26596132 hodcbme@admin.iitd.ac.in Rural Development and Technology 26591121 hodrdat@admin.iitd.ac.in Sensors, Instrumentation and Cyber- physical Systems Engineering 26591431 hodsense@admin.iitd.ac.in National Resource Centre for Value Education in Engineering 26596585 hodnrcvee@admin.iitd.ac.in Transportation Research and Injury Prevention 26596361 hodtripc@admin.iitd.ac.in Optics and Photonics 26591336 hodopc@iitd.ac.in SCHOOLS Amar Nath and Shashi Khosla School of Information Technology 26596056 hodsit@admin.iitd.ac.in Bharti School of Telecommunication Technology and Management 26596200 bharti.coord@admin.iitd.ac.in School of Artificial Intelligence ----- office@scai.iitd.ac.in Kusuma School of Biological Sciences 26596104 biocoordinator@admin.iitd.ac.in School of Interdisciplinary Research 26548519 headsire@admin.iitd.ac.in School of Public Policy 26596508 hodspp@admin.iitd.ac.in INTERDISCIPLINARY M.Tech. PROGRAMME Energy Studies 26591251 hodces@admin.iitd.ac.in Cyber Security 26597351 hodcsia@admin.iitd.ac.in Instrument Technology 26591437 gufranskhan@sense.iitd.ac.in VLSI Design, Tools and Technology 26591085 shouri@ee.iitd.ac.in Telecommunication Technology\"", "[38] \"and Management 26596200 bharti.coord@admin.iitd.ac.in Opto-Electronics and Optical Communication 26591331 joyee@physics.iitd.ac.in  P a g e | 36 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI ANNEXURE-I RESEARCH PROGRAMMES: DOCTOR OF PHILOSOPHY (PH.D.) The Institute offers research programmes leading to the degree of Ph.D. in the following areas in the various Departments/Centres/Schools. Department of Applied Mechanics [Code AMZ] Research Areas in Solid Mechanics: Large Deformations, Impact Mechanics, Elasticity, Piezothermoelasticity, Composite Materials and structures Plates and Shells, Non-linear Dynamics and Chaos, Off-Shore Structures, Smart Structures, Structural Stability, Snow Mechanics, Dynamic Plasticity, Nano Composites, Damage Mechanics, Soft Materials, Structural Health Monitoring, Functionally Graded Structures, Multi-Scale Modelling of Nano-Structures, Biomechanics/Cell Mechanics, Cardiovascular Biomechanics,Brain Biomechanics, Computational Surgery, Fracture Mechanics, Machine Learning, Stochastic Mechanics. Research Areas in Fluid Mechanics: Internal and External Flows, Solid-Liquid Flows, Computational Fluid Dynamics, Hydrodynamic Stability; Turbulence, Aerodynamics; Turbulent Heat Transfer Compressible Flows, Fluid-structure\"", "[38] \"Interaction, Stratified Flows, Low Dimensional Modeling. Research Areas in Design Engineering: Computer Aided Design, Design Engineering., Reliability Engineering, Engineering Alternative, Ergonomics, Reverse Engineering, Design and Analysis of Biomedical Devices, Compliant Mechanisms and Smart Instrumentation, Bio-inspired Engineering, Design under Uncertainty. Department of Biochemical Engineering and Biotechnology [Code BEZ] Microbial and Enzyme Engineering: Analysis and design of microbial and enzyme reactors for production of industrially important products such as biofuels, industrial enzymes, biopolymers, organic solvents, biofertilizers and biopesticides etc.; development of bio-sensors for detection of various analytes; Whole cell catalyzed biotransformations. Bioseparation and Downstream Processing: Membrane based separation processes, chromatographic separation processes, Membrane processes for water recycle. Metabolic engineering: Application of metabolic engineering principles for the development of cell factories for the production of important metabolites including renewable chemicals and therapeutic compounds. Animal and plant cell culture: Development of cell culture techniques for cultivation of plant and animal cells in specialized reactors\"", "[39] \"for production of therapeutic compounds.  P a g e | 37 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Environmental Biotechnology: The development of reactors and processes for stabilization of organic and industrial wastes; Laccase engineering for treatment of textile effluents; Effect of environmental factors on microbial community dynamics. Biochemistry and molecular biology: Industrial enzymes, development of recombinant clones for over- production of enzymes and metabolites, development of expression systems in bacteria and yeasts, Human therapeutics production in yeast, bioenergetics and biological molecular machines, Nanoparticle-based drug delivery and protein-based nanodevices, cancer biology, microRNA biology. Bioinformatics and Genomics: Genome editing with programmable nucleases; analysis and interpretation of next-generation sequencing data; traditional home-medicine and cancer big data analysis. Biophotonics: Development of fluorescence and optical imaging methods for detection of single molecules to the whole cell. Application of these methods for biosensing of pathogenic\"", "[39] \"microbes and cancer cells. Agricultural Microbiology: Plant microbe interactions; biocontrol. Electromicrobiology: Extracellular electron transfer; microbial electrochemistry. Department of Civil Engineering [Code CEZ] Environmental Engineering: Urban air quality management; indoor air pollution; water and waste water treatment; Emerging water contaminants (Nano particles, Antibiotics); urban water and waste water Management; Non-point source Pollution; Membrane Biological Treatment Process; Modeling, simulation and optimization of Environmental systems; Environmental Impact Assessment; Human Health Risk Assessment; solid waste management; incineration waste-to- energy; circulating fluidized bed operations; Landfill Management; Carbon sequestration; sustainable development (Urban cities/growth centres); Environmental Risk Analysis, GIS and Remote Sensing Applications for Environmental Management. Aerosol characterization, local and regional air quality, climate change and health impact. Geotechnical Engineering: Soil Mechanics and Foundation Engineering; Rock Mechanics, Rock Engineering and Underground Structures; Rock Dynamics; Geo-environmental Engineering; Landfills; Ash Ponds and Ash Utilization; Geotechnical Re-utilization of waste; Energy Geotechnology; Slope Stability and Dams; Ground Improvement; Geosynthetics; Reinforced Soils;\"", "[40] \"Soil Dynamics and Earthquake Geotechnics; Foundations for Industrial Machines; Site specific response studies; Engineering Geology; Seismic Hazard Analysis and Microzonation; Expansive Soils; Geophysical Methods; Geotechnology for tracks and pavements; Blast and Impact Analysis; Dynamic Behaviour of Tunnels and Slopes; Landslides in Static and Dynamic Conditions; Offshore Geotechnology; Constitutive Modelling; Numerical Methods; Mechanics of granular materials; Post- Geodisaster Reconnaissance Studies; Bioinspired Geotechnics.  P a g e | 38 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Structural Engineering : Analysis and design of structures; tall buildings; bridges; Earthquake engineering; wind engineering; offshore structures; masonry, RCC and steel structures; Construction Management; Construction Technology; Concrete Technology; structural dynamics; structural control; wave propagation; constitutive modeling; computational methods; modeling of damage, plasticity and creep of concrete; durability of concrete; rebar corrosion; modeling of cements; supplementary cementitious materials; use of marble, granite or other waste powder in\"", "[40] \"concrete; composites; high performance concrete; self-compacting concrete; financial analysis; contract administration, quantitative methods in construction management; Infrastructure Project Management Risk and Financial Management; sustainable construction, green building, resilient infrastructure, design management, automation in construction; BIM (Building Information Modeling) in construction projects; structural health monitoring; smart materials and structures; meta material; tensegrity structures; biomechanics; engineered bamboo structures; artificial intelligence; damage assessment and strengthening; microstructural modeling; mechanics of composite materials; non-destructive testing and evaluation using ultrasound; subsurface imaging using ultrasonic wave propagation; piezoelectric energy harvesting; radiation damage; nanomechanics; multiscale modeling; fracture and failure modeling; mechanics of glasses & disordered materials; atomistic modeling, machine learning. Transportation Engineering : Transport planning; Transport policy; Transportation safety; Construction work zone safety; Heterogeneous traffic flow modeling; Traffic safety and capacity of hill roads; Mass transportation planning; Urban transport infrastructure planning and design; Non-motorized transport planning; Modeling of pedestrian behavior; Activity-travel behavior analysis; Network modeling; Transportation logistics and\"", "[40] \"optimization; Traffic operations; Geometric design of transportation infrastructure; Characterization of pavement materials; Pavement design (flexible and rigid); Damage modeling of bitumen and bituminous mixtures; Constitutive modeling of pavement materials; Recycling of civil infrastructure materials; Rheology of asphaltic materials; Condition assessment of highway infrastructure; Pavement management systems; Highway engineering; Airport infrastructure. Water Resources Engineering : Hydrology in natural and urban environment; Hydrological modeling and simulation; Stochastic processes; Data mining in hydrology; Flood forecasting and modeling; Snow and glacier hydrology; Snow dynamics; Hydroclimatology; Climate change effects in water resources; Watershed modeling; Large river basin modeling; water resources systems, planning and management; Water allocation; Water resources conflicts; Irrigation management; Flow through porous media; Groundwater modeling; Ground water contamination & remediation; Contaminant transport modeling; Leachate pollution; Bioremediation; River water quality modeling; Environmental impact assessment of water resources projects; Surface and subsurface drainage; Hydraulic structures; Sediment transport; Application of numerical methods, CAD, FEM, GIS, and\"", "[41] \"Remote sensing in Water Resources Engineering. Slurry Pipeline, CFD modeling of Multiphase flows, Economic Analysis of water resources projects; Anomalous Hydro Dynamics; Transport Phenomena.  P a g e | 39 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Department of Chemical Engineering [Code CHZ] Catalysis and reactor engineering, Multiphase flow & rectors, Control of reactors, Petroleum refining engineering, Computer Aided Design, Computational fluid dynamics, Microfluidics, Hydrodynamic, instability, Particle technology, Mixing, Fluidization, Distillation and other separation processes, Complex fluids, Interfacial engineering, food, Polymers, Polymer rheology, Membrane synthesis & processes, Biomass, Bioseparations and Bioprocessing, Process operations planning and scheduling, Biosimilars, Quality by design, Protein characterization, Colloids, and interfacial science, Nanotechnology, Biosensors, Renewable energy, Biorenewable Chemicals and Solid Oxide Fuel Cells, Electrochemical process, Hydrogen fuel cells, Lithium-ion batteries, Electrochemical modeling Supercapacitor, Electrochemical energy storage Devices, Flow batteries, Therapeutics, Drug delivery, Waste management, Environmental engineering,\"", "[41] \"Aerosols, Air Pollution, Process systems engineering, Model Predictive control, Process monitoring, Application of machine learning in chemical process modeling and control Structural Bioinformatics, Polymer Informatics, Computational material design, Density Functional Theory and Molecular Dynamics Simulations. Department of Computer Science & Engineering [Code CSZ] Algorithms and Complexity Theory: Algorithmic graph theory, Computational geometry, Randomized algorithms, Approximation algorithms, Complexity theory, Online algorithms. Artificial Intelligence (AI) and Machine Learning (ML): Reinforcement learning and AI planning, Neuro- symbolic ML, Probabilistic graphical models, Statistical relational learning, Extreme classification, Embodied artificial intelligence, Ethical AI, Fairness and reliability in ML, Privacy issues in ML, ML for social networks, ML applications to healthcare, AI for crowdsourcing, Knowledge-based AI, Computational advertising, AI for robotics. Natural Language Processing (NLP): Intelligent information systems, Information extraction, Question answering, Dialog systems, Knowledge-base completion, Neural architectures for NLP. Databases and Data Analytics: Intention mining, Policy driven databases, Information retrieval, Information dissemination in social networks,\"", "[42] \"Semantic web data management, Opinion mining, Indexing and querying in graph databases, Spatio-temporal data analytics, Data wrangling. Architecture and Embedded Systems: Hardware-software co-design, Embedded systems design, Reconfigurable computing, Fault-tolerant computing, Hardware implementations, Temperature- aware architectures, Energy-efficient architectures, Design-for-debug, Cache memory, 3D and non-volatile memory, Architectural extensions for mobile security, Architectures for machine learning, Architectures for computer vision, Secure architectures.  P a g e | 40 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Graphics and Vision: Computer graphics, Virtual reality, Computer vision, Digital image and video processing, Mobile multimedia, Embedded computer vision, Robotic vision, Medical image analysis. Computer Networks and Distributed Systems: Mesh networks, 4G LTE/ WiMAX, Cognitive radio, Cellular network measurements, Wireless networks, Network security, Operating systems security. Programming Languages, Semantics and Verification: Programming language semantics, Theory and practice of concurrent systems, Process algebras, Distributed computing, Program analysis and verification,\"", "[42] \"Logic in computer science, Applications of verification in network models, multiprocessors, and relaxed memory models. Operating Systems, High Performance Computing and Systems Software: Compiler design, mobile operating systems and device drivers, Operating systems for IoT system Information and Communication Technologies for Development: Poverty mapping, Urbanization, Bias in mass media, Computer systems for less-literate populations, Content distribution in rural areas, Community radio, Community media, Mobile health, Governance and accountability. Neuroinformatics and Medical informatics: Functional MRI (fMRI), Electroencephalography (EEG), Near- infrared spectroscopy (NIRS), Human Functional Connectome, Statistical Modeling, Yogic Neuroscience. Cyber Security and Secure Information Systems: Formal notions of security, Formal verification for security, Language-based security, Secure architectures and Embedded systems, Network security, Blockchain-based systems, Privacy and data protection, Electronic voting, Digital identity. Department of Chemistry [Code CYZ] Asymmetric synthesis & catalysis, Carbohydrate chemistry, Peptide synthesis, Synthetic & Mechanistic organic chemistry, Total synthesis of bioactive natural products, Supramolecular chemistry, Biochemistry (Enzyme technology,\"", "[43] \"Microbial Biochemistry, Fermentation & Bio- remediation, Cloning & Proteomics, Nucleic acid biochemistry), Bio-inorganic chemistry, Bio- organic chemistry, Bio-physical chemistry, Physical-organic chemistry, Bio-inspired catalysis, polyoxometalate chemistry, Organometallic and Main group chemistry, Coordination chemistry, Solid state chemistry, (Molecular Organisation & Recognition), Fluorescence spectroscopy (Ensemble & Single molecule), vibrational spectroscopy & Imaging, NMR spectroscopy, Nano- materials (Optical Properties, Photovoltaics, biological), Nano-catalysis in ionic liquids, Electrochemistry, Photo redox and electrocatalysis, CO2 reduction, Energy storage, Water splitting, Artificial photosynthesis, Surface chemistry & Heterogeneous catalysis, Quantum & Classical computer simulation on chemical & biological systems, Theoretical chemistry.  P a g e | 41 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Department of Design [Code DDZ] Age-friendly Built Environments; Analogical design (including Biologically-inspired Design); Animation; Artificial Intelligence in Design; Augmented, Virtual and Mixed Reality; Behavioural Design (Methodology and Methods); Comics Studies; Computer Aided Design and Manufacturing; Computer\"", "[43] \"Graphics; Craft Practices; Creativity in Art & Design; Data-driven Design for Environmental Health; Data Science and Design; Design & Culture; Design Cognition and Behaviours of Designers; Design for Children’s Education; Design for Development/Base of the Pyramid; Design for Environment; Design for Health and Wellness in Built Environment; Design for Industry 4.0; Design for IoT for Environmental Health; Design for Product Life-Cycle; Design for Sustainability; Design for Sustainable Behaviours (Health, Environment and Socially Responsible Design); Design for Wellness; Design of Assistive Technologies; Design of Healthcare Environments; Design of Sustainable Habitats; Design Theory & Methodology; Digital Heritage; Environmental Ergonomics; Film Making; Graphic Design; Healthcare Design; Human Factors & Ergonomics; Immersive Media Design in Education; Inclusive Mobility; Industrial Design; Packaging Design; Product Design; Qualitative Research Methodologies; Sedentary Behaviour and Health; Study of Creative & Aesthetic experiences from Perspectives of Philosophy, Psychology, Phenomenology & Cognitive Neuroscience; Universal Design; Usability; User Experience; Visual Communication; Visual\"", "[43] \"Narratives. Department of Electrical Engineering [Code EEZ*] Circuits, Systems and Devices Engineering: CMOS technology and VLSI design, device modeling, simulation and characterization, device fabrication and reliability, compact modeling and PDKs, nanoelectronics, quantum computing, nanomaterials, nanophotonics, plasmonics, biosensors, fiber-optic and chip based optical sensors, photonic and optoelectronic materials and devices, LEDs and solid state lighting, CMOS image sensors and vision systems, photovoltaics and photodetectors, memory devices and architecture, logic device design, neuromorphic computing and NVRAM technology, machine learning, bio-inspired devices and circuit design, spintronics and micromagnetics, MEMS evices, energy harvesters and piezoelectric devices, low-power analog design, low-cost sensors and flexible electronics, quantum electronics, energy harvesting, measurement and instrumentation, power semiconductor devices, analog and mixed signal circuit design, high speed circuit design, electromagnetics, microfluidics and microplasmas. Power Engineering: Electric machines and drives - Electric machine design, control and converter design, Power electronics - converter topology, multilevel converters, magnetic component design, Wide Band\"", "[44] \"Gap device converter design, Power systems - Protection, stability, optimization, power quality, HVDC & FACTS, Computer applications - development and design of control platforms, CAD software for system development, Renewable energy systems - Solar, wind, micro hydro etc. Communication Engineering: Signal Processing, Speech and Image Processing, Coding & Information Theory, Communication Systems, Optoelectronics, Optical Communications, * Full-time applicants with UGC (JRF), CSIR (JRF) and other government funded fellowships (OGF) will also be considered. Applicants must have a minimum of four-year education after 12th standard with degree in science, engineering, or medicine (B.Tech./M.Sc./BE/BS/MBBS) or equivalent.  P a g e | 42 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Communication Networks, Wireless and Mobile Communications, Microwaves, Antennas. Computer Engineering: Computer Vision, Multimedia Systems, Image Processing, Computer Networks, Computer Architecture, Embedded Systems, Mobile computing, soft computing, Pattern Recognition, Artificial Intelligence, Information Technology, Music\"", "[44] \"information retrieval, Bioinformatics, Brain-computer interface. Control Engineering: Robust Control, Intelligent Control, Robotics, Optimal Control, System Identification, Neuro-Fuzzy Control, Reinforcement Learning Control, Nonlinear Systems and Control, Dynamical Systems, Applications to Biomolecular Circuits, Flight Control and Navigation, Adaptive Control, Cooperative Control and Path Planning, Sensor Fusion, Guidance, Navigation and Flight Control, Sliding Mode Control, Interval Analysis in Control Design, Computational Methods, for Simulation and Control, Modeling and Model Order Reduction, Attitude Control and Structural Control, Numerical Modeling and Simulation Embedded Control System. Department of Energy Science and Engineering [Code ESZ] Internal Combustion Engines, Thermal Engineering, Solar Thermal, Power Systems, Power Electronics, Machine Drives, Control System and Devices, Instrumentation and Control, Solar Photovoltaics, Wind Energy, Hydro Power, Plasma Science and Technology, Nuclear Engineering, Energy Conservation and Management, Bio Energy, Water Resources Engineering, Turbo Machinery, Functional Materials, Building Design and Energy Management, Computational Fluid Dynamics (Thermal Fluids), Fuel cell Systems, Energy Storage and supercapacitors.\"", "[45] \"Department of Humanities & Social Sciences [Code HUZ] Literature, Sociology, Psychology, Linguistics, Philosophy, Economics, Psychology (Cognitive Neuroscience). Note: Candidates must refer to the Department website (http://hss.iitd.ac.in/areas) for details on areas of specialization in which applications will be considered. Department of Mathematics [Code MAZ] Algebra, Cryptography, Numerical Linear Algebra, Number Theory and Combinatorics, Dynamical Systems and Fractals, Topology, Algebraic Topology, Harmonic Analysis, functional Analysis, Operator Theory, Micro Local Analysis, Numerical Analysis, Partial and Stochastic Differential Equations, Algorithms and Graph Theory, Machine Translation, Applied Probability, Stochastic Modeling, Queueing Theory, Optimization, Game Theory, Financial Mathematics.  P a g e | 43 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Department of Mechanical Engineering [Code MEZ] Design Engineering: Mechanical Vibrations, Rotor Dynamics, Smart structures, Experimental Modal Analysis & Identification, Structural Dynamic Modification, Finite Element Model Updating, Acoustics and noise control, Active control of sound and\"", "[45] \"vibration. Condition Monitoring and Fault Diagnosis, Bearing Dynamics, Lubrication, Polymer Tribology, Bio- tribology; Precision Machine Design, Computer Aided Mechanical Design, Computer Controlled Mechanisms, Vehicle Dynamics, Modelling the Impact of Vehicles, Mechanisms, Robotics (including Medical Robotics), Medical Devices/instruments, Multibody Dynamics, Design and analysis of Rural Engineering Systems, Mechatronics, Sensors and Actuator Design, MEMS, Design of Microsystems, Artificial Intelligence Applications Computational Mechanics, Fracture Mechanics, Fatigue & Failure analysis, Composite Mechanics, Impact Mechanics, Nanomechanics, Experimental solid Mechanics, Impact Biomechanics, Tissue biomechanics, Orthopaedic Biomechanics, Implant Design, Musculoskeletal modelling, Gait and Motion Analysis. Thermal Engineering: Design and analysis of thermal systems/processes based on fundamentals of thermodynamics, fluid mechanics, heat and mass transfer, and combustion through experimental/analytical/computational studies. The specific research areas include the following: Phenomenological and multi-dimensional modelling of IC Engines, Combustion systems, Clean coal technologies, Biomass gasification and char-making, Air pollution characterization and remediation, Microfluidics, Fluidstructure interaction, Fluid dynamics and heat transfer in biosystems\"", "[46] \"Inverse heat transfer, Multiphase flows, Boiling, Condensation, Melting, Solidification, Heat and mass transfer in drying of porous media, Turbomachinery including compressors, steam/gas/hydel turbines, micro and pico-scale turbomachines, Rural energy systems, Thermal comfort, Refrigeration and air conditioning, Thermal energy storage, Energy efficient buildings, Solar cooling, Water purification and desalination, Electrochemical Energy Systems. Production Engineering: Metal Cutting, Metal Forming, Welding, Metal Casting, Material Characterization, Nontraditional Manufacturing Processes, Measurements & Metrology, Grinding of Ceramics and Metal Matrix Composites, Processing of Polymers & Composites, Injection Moulding, Microcellular Injection Moulding, Finite Element Applications in Manufacturing, CAD/CAM, Rapid Prototyping, Intelligent Manufacturing, Micro & Nano-Manufacturing, Biomaterials and Medical Implants, Nanocomposites, Modelling of Material Behaviour, Lean concepts in Machine Tool Design. Manufacturing Automation, Magnetorheological Finishing, Additive manufacturing, Laser material processing, Auxetic metamaterials, Ballistic Materials and Manufacturing of High-Performance Composites, Diamond brazing, joining of ceramics to metals, Microstructural Evolution, Development of cutting tools, Coating Technology.  P a g\"", "[46] \"e | 44 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Industrial Engineering: Public Systems, Quality, Reliability and Maintenance, Lean Manufacturing, Agile Manufacturing, Productivity Management, Operations Management, Project Management, Supply Chain Management, Flexible Systems, Healthcare Systems, Intelligent Manufacturing Systems, e-Business, Reverse Logistics, Financial Engineering, Wireless Systems; Operations Research, Applied Probability Models, Decision Support Systems, Linear and Nonlinear Optimization, Combinatorial Optimization, Simulation, Machine Learning and Data Analytics, Simulation Modelling, Heuristic Optimization, Multi-agent Planning. Department of Materials Science and Engineering [Code MSZ] High Performance Materials:  Metals, Glass and Ceramics: Structure-property correlation in advanced materials, Fracture and Fatigue, Indentation, nano-scale friction and wear, Material characterization using advanced microscopy, phase transformations, solid-state diffusion-controlled reactions, Synthesis and characterization of Metal matrix composites, Light metals and alloys, 3D printed metals and alloys, Auxetic materials, Bulk metallic glasses and composites, functionally graded materials, nanomaterials. Advanced ceramics, high entropy\"", "[46] \"alloys, materials for extreme environments, thermal barrier coatings, alloy processing and properties, refractory metals and compounds, aluminide bond coats. Optical glass, toughened and tempered glass, structural and functional ceramics and glass ceramics.  Polymers: Synthesis of polymers, structure-property correlation in polymers, rheology and processing of polymers, functional and smart elastomeric materials, polymer matrix composites, tribology and mechanical behaviour of polymers, 3D printing of functional elastomeric/polymeric materials, membranes for various applications, antifouling and antibiofouling materials and membranes, redox polymers, materials for energy storage, separation and purification, organic- inorganic hybrid materials, catalytic materials and nanomaterials for catalysis and environmental applications, 2D materials, graphene, Covalent organic frameworks, biodegradable materials and biomaterials, organically modified mesoporous silica nanoparticles, surface engineering using controlled radical polymerization techniques, recycling of materials, 3D printing.  Computational Materials Science: First-principles based materials design, micromagnetic simulations, computational materials chemistry, molecular modelling and simulations of soft materials (self-assemblies, (bio)polymers, nanomaterials), machine learning\"", "[47] \"for materials informatics.  Functional Materials: Semiconductor nanostructures and device applications, magnetic nanowires and magnetic tunnel junctions for spintronics device applications, MEMS/NEMS devices, solar cell, organic electronics.  P a g e | 45 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Department of Physics [Code PHZ] Condensed Matter Experiments: The research activity of condensed matter experimental (CME) group at the Physics department covers a wide range of topics such as (i) nanostructured materials, thin films and devices, (ii) novel magnetic multifunctional and topological materials, (iii) spintronics and magnetism, and (iv) wide band gap semiconductors such as GaN and Ga2O3, AlGaN/GaN heterostructures, 2D quantum materials like grapheme, transition metal dichalchogenides and thin-films of half Heusler alloys Growth and nanoscale devices based on semiconductor nanowires, and (v) optical properties of condensed matter e.g., ultrafast dynamics of condensed matter with femtosecond laser. CME group\"", "[47] \"houses several specialized laboratories as well as several departmental facilities. The CME group has close links with Central Research facilities (CRF) and Nanoscale Research Facility (NRF) of the Institute. NRF houses Class 100 and 1000 clean rooms as well as several characterization facilities. At present, the department has an X-Ray diffractometer, an X-ray photoelectron spectroscopy, a SQUID magnetometer, a physical property measurement system (PPMS), ultrafast-optics laboratory (also housing a Raman spectrometer and a photoluminescence set-up), a pulsed laser deposition (PLD) system and an atomic force microscope as departmental facilities. Individual research labs also have several state-of-the-art facilities, the details of which can be found by visiting the corresponding laboratory web pages. Condensed Matter Theory: The CMT group has an interdisciplinary focus with broad research interest spanning form first principles-based simulation of designing new materials and understanding their properties using “state-of-the-art density functional theory (DFT) and beyond methods” to the theoretical\"", "[47] \"modelling transport and other properties of various condensed matter systems. We also theoretically model transport in quantum Hall systems, graphene, and topological insulators. Quantum simulation of exotic condensed matter phases with ultra-cold atoms is another area of expertise. Our research also aims to theoretically discover and characterize different topological phases consisting of fractional fermions and Majorana fermions with features uniquely advantageous for topological quantum computing. Using DFT we probe the fundamental physics and related technological applications for atomic and many-atomic complex systems. Some properties of our interest include electronic and band structure, electric and magnetic properties, phonons, magnons and electromagnons in complex (anti) ferroic oxides bulk and nanostructures. We also use ab initio calculation to explore the viability and rational design of real-world functionalized CNT metastable photo switches and single-photon emitters (SPEs). We also theoretically model transport in quantum Hall systems, graphene, and topological insulators. Quantum simulation of exotic condensed\"", "[48] \"matter phases with ultra-cold atoms is another area of expertise. Our research also aims to theoretically discover and characterize different topological phases consisting of fractional fermions and Majorana fermions with features uniquely advantageous for topological quantum computing.  P a g e | 46 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Statistical and Computational Physics: Statistical Physics is devoted to understanding macroscopic assemblies of identical particles. Such systems appear over a wide range of length scales in many different fields. We study diverse systems of contemporary interest, ranging from classical solids, exotic liquids, soft materials, mesoscopic systems and active matter to name a few. Broadly, our research encompasses the following themes: (i) emergent phenomena in complex spin systems with disorder and long-ranged interactions; (ii) non-equilibrium properties of complex fluids such as liquid crystals, ferronematics and patchy colloids; (iii) miniature heat engines,\"", "[48] \"and particle and heat transport in mesoscopic systems; (iv) motility of micro-organisms on surfaces and micro-swimmers in Newtonian and non-Newtonian fluids; (v) pattern formation in granular materials; and (vi) mechanics of extremely flexible structures such as thin films. We use a variety of analytical techniques from equilibrium and non-equilibrium statistical physics, computational techniques such as Monte Carlo, parallel tempering, molecular dynamics and graph cuts along with experiments involving state-of-art imaging techniques and sensitive mechanical characterization. High Energy Physics: High energy physics encompasses both the very small and the very large distance scales — of elementary particles (femtometer scale) and of the observed universe (cosmology)! It is well described by the standard model, which brings together three fundamental interactions — electromagnetic, weak and strong. Collider physics is a tool which combines both perturbative and non-perturbative aspects of these interactions. We study particle production in collider interactions in an attempt to understand\"", "[48] \"both. In particular, strong interaction, described by quantum chromodynamics, is per se notoriously difficult. We employ effective field theoretical techniques to understand its non- perturbative aspects — to study low energy properties of hadrons and quark gluon plasma. We also use them to study particle production in gravitational fields, and also some aspects of quantum gravity. Standard model, though stupendously successful, is still incomplete which makes HEP even more exciting. There are several theoretical problems; even more, there are experimental hints for rich physics beyond the standard model. We study this in the context of topics such as neutrino physics and dark matter. Optics and Photonics: Historically the Physics Department at IIT Delhi has a strong background in broad areas of Optics and Photonics. IIT Delhi started the first Optics Master's program in the country in 1960's. At present the Physics Department has approximately 15 faculty members engaged in Optics\"", "[49] \"and Photonics related research. Current research activities span a wide ranging topics that include areas of fundamental importance (e.g. Physical Optics, Statistical Optics, Singular optics and inhomogeneous polarization states, quantum photonics, non-linear optics, nano-photonics/metamaterials, light propagation in random media) as well as cutting edge applied research areas (e.g. integrated optics and optical communication, holography, microscopy/nanoscopy, optical metrology, computational imaging, green photonics, illumination engineering, bio-photonics including applications to medical diagnostics, THz optics, ultrafast optics, spectroscopy, optical tweezers, beam engineering, atmospheric optics and development of optical sensors). Optics and Photonics faculty have number of collaborations across different disciplines within IIT Delhi (electrical engg., biosciences/biomedical engg., material science,  P a g e | 47 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI chemistry), as well as outside IIT Delhi with DRDO, ISRO and other national research facilities like CSIR labs, as well as medical\"", "[49] \"schools/hospitals (e.g. AIIMS), and industry. The department hosts a DST-FIST facility on ultrafast optics that has state-of-the-art instrumentation enabling collaborative work with various disciplines. Physics of Quantum Materials & Information Systems: The 3 focused attempts in quantum computation (QC) are- (i) Majorana-based topological quantum computation (TQC) (ii) superconducting qubits-based QC and (iii) trapped ion-based QC. Importance of the field is evident from the fact that Google and IBM have invested heavily in superconducting qubits while Microsoft has invested in Majorana qubits. The focus of our department is towards (i) cold atom-based quantum technologies, (ii) quantum photonics and (iii) general Quantum Materials like Topological Insulators, quantum well based semiconductor technologies, spintronics related research etc. In cold atom-based technologies, the atoms are cooled to million times colder than room temperature using precisely frequency tuned lasers. The inherent quantum nature of atoms and photons allows one to design versatile quantum systems and fully\"", "[49] \"control their properties by simple and clever approaches. These technological and conceptual developments will lead us to build large scale quantum information processing network, quantum computation protocols for solving industry and society relevant problems. A group of researchers, in the department are putting their efforts in the direction of studying Topological semi-metals, a quantum phase of matter that host Dirac and Weyl fermions. They study the transport properties of these exotic materials under very low temperature, high magnetic field and high pressures and realise the exotic quantum features in the laboratory scale. Plasma Physics: Plasmas are known to be the fourth state of matter. These contain large number of positive ions and electrons in almost equal number along with some neutral particles. Negative ions can also occur in plasmas and also there can be dust particles, referring to them as multi- component / dusty plasmas where the charge neutrality holds\"", "[50] \"good. However, the dynamics of plasma greatly alters due to the presence of such additional charges. Each plasma species can contribute to different application of plasma. For example, electrons are responsible for high frequency phenomena including EM radiation generation, whereas the ions contribute to the synthesis of materials, surface hardening, sputtering, deice fabrication etc. We are primarily working in the broad research areas of intense laser-plasma interaction, plasma- material interaction, plasma propulsion, plasma-based radiation sources, and dusty plasmas. We employ theoretical approach including nonlinear physics as well as numerical methods, namely, hydrodynamics, molecular dynamics and particle-in-cell (PIC) techniques to investigate some of the above areas and also perform experiments.  P a g e | 48 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Atomic and Molecular Physics: Our area of interest is ion-atom/molecule/cluster/ices collisions. Heavy ion impact Ionization and fragmentation of\"", "[50] \"the molecules of biological and astrophysical interest are studied. Our area of expertise include secondary electron spectroscopy, recoil-ion- momentum spectroscopy and Infrared spectroscopy. We are also interested in development of equipment which are useful in atomic physics experiments and our aim is to collaborate with the industry to make them commercially available. Astrophysics: Research in the Astrophysics group at the Physics Department, IIT Delhi revolves around open questions such as:  What is the small-scale structure of space time?  How do the matter and gravity interact in the quantum picture?  What leads to the emergence of \"classical\" reality?  What are the quantum effects in gravity and how to test them? In tandem with this, we also make contact with observations in Astronomy and Astrophysics, especially employing Optical and Radio data. In an ongoing effort in this direction, we are involved in mapping the magnetic field of our\"", "[50] \"galaxy, the Milky way, through pulsar observations. Department of Management Studies [Code SMZ] Economics: Managerial Economics, International Economics, Productivity and Efficiency Analysis, Business Forecasting, Economic Feasibility & Techno economic Analysis, Sustainable Development, Socio-economic Analysis, Energy Economics, Econometric Methods and Applications, Macroeconomic Theory and Policy. Security and Information Risk, Merger and Acquisitions, Big Data Analytics, Digital Economy, Development Economics, Public Policy, Entrepreneurship, Environmental Economies and Climate Change. Finance: Financial Analysis and Valuation, Financial Management, International Financial Management, Capital Markets, Derivative Securities, Portfolio Management, Mutual Funds, Banking, Financial Markets and Services, Mergers and Acquisitions, Risk Management, Behavioral Finance, Corporate Governance, Corporate Social Responsibility, Supply chain Finance, Entrepreneurial Finance. Human Resource Management: Organizational Behaviour, Ethical Decision Making, Whistleblowing, Ethical leadership, Organization Management and Change, Organization Development, Human Resource Management, Career Management, Flexible Work Arrangements, Workplace Deviance, Workplace Incivility, Gig work and workers, Identity work. Information Systems: Adoption, Impacts and Management of Emerging ICTs;\"", "[51] \"Data Science; Artificial Intelligence and Machine Learning; Social Media and Web 4.0; Digital Transformation; Smart Cities; ICTs, Development and Business; E-Commerce & M-Commerce; Sharing / Platform Economy; e-Governance; Digital services management; Cyber Security, Privacy and Information Risk Management; Public Policy for Emerging Technologies; Blockchain; Internet of Things; Financial technologies; Healthcare technologies.  P a g e | 49 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Marketing: Marketing Management, Industrial and Hi-Tech Marketing, Advertising, Sales promotion. Operations: Production, Management and Operations research, Sustainable and Big Data Operations, International Manufacturing Network, Enterprise Resources Planning, Project Management, Modeling and Simulation of Operations, Healthcare Operations System Analysis, Total Quality Management, Logistics Management, Modelling and Simulation Closed Loop Systems, Industrial Waste Management, Supply Chain, Big Data Analytics, Deep /Machine Learning, AI Implications, Sustainable Humanitarian Supply Chain Solution and Green Packaging. Strategy: Management of Technology, Corporate Strategy,\"", "[51] \"Global Competitiveness, Strategic Innovation, Flexible Systems Management, Business Process Re- engineering, Strategic Business Management, Knowledge Management, International Business, Intellectual Property Rights, Strategic Thinking. Department of Textile and Fibre Engineering [Code TTZ] Textile Engineering: Design and analysis of yarn and fabric formation systems: rotor spinning, ring spinning, air jet spinning, friction spinning, weaving, knitting, nonwovens, braiding etc. ; Structural mechanics of textiles; High stress elastic materials; Apparels and garments; comfort; handle and other functional aspects of fibrous assemblies; Design and development of technical textiles: geo- textile, filter fabrics, medical textiles, protective textiles, textile composites etc.; Systems analysis; Textile production and marketing: operation management and supply chain managements; Textile production and marketing: operation management and supply chain managements; Textile Instrumentation and machine development; Modeling and simulation of textile processes and products; Quality management. Textile Chemical Technology: Textile chemical processing; preparatory processes; dyeing, printing and finishing, Surface functionalization by plasma and UV excimer\"", "[52] \"lamp; Micro and nano- encapsulation; Conducting textiles; Natural dyes; Bio-active textiles; Textile ecology and environment. Fibre Science & Technology: Synthesis and characterization of advance of advanced polymeric materials; Fibre formation processes; Modeling and simulation; Structure-property correlation; Functional and responsive polymers; Smart & intelligent textiles; Modification of natural and synthetic fibres; Nanotechnology in textiles: nonfibres by electrospinning, nanomaterials; Synthesis and application in textiles; Coated textiles; Polymer nanocomposites; Green Composites; Medical textiles, Tissue engineering; Sustainability and polymer & fibre recycling; 3D Bioprinting; Wearable electronics: Conducting fibres, piezoelectric materials, Supercapacitors, batteries etc.  P a g e | 50 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Centre for Applied Research in Electronics [Code CRZ] Signal Processing: DSP Algorithms and Systems, Underwater and Air Acoustics, Speech and Audio Processing, Machine Learning, Optimization for Signal Processing, Digital Communications, Multi- Sensor Data Fusion; Microwaves and RF: Active\"", "[52] \"and Reconfigurable Circuits and Antennas, Millimeter Wave and T Hz circuits and sub-systems, Microwave imaging; RF MEMS, Wideband Microwave Circuits, Modeling of Active Devices; Microelectronics: Micro-Electro-Mechanical Systems (MEMS) Technology, Nanoelectronics Devices, Optoelectronic & Quantum Sensors, CMOS Device & Circuit Design, GaN HEMT Design & Modeling, Magnetic/spintronic and neuromorphic devices. Centre for Atmospheric Sciences [Code ASZ] Mesoscale Modelling: Numerical Modelling of the Atmosphere, Tropical Meteorology and Indian Monsoon, Land-Surface Process Modelling, Land-Atmosphere Interaction, Renewable Energy Meteorology, Renewable Energy Resource Assessment and Forecasting. Numerical Modelling of Weather and Climate: Numerical Methods for Weather and Climate Models, Numerical Modeling of the General Circulation of Atmosphere and Advection of Atmospheric Tracers. Ocean Modelling: Ocean Circulation Modelling, Ocean State Simulations and Forecasting, Storm Surges and Inundation, Coastal Ocean Processes, Simulation of Ocean Surface and Internal Waves. Climate and Climate Change: Global and Regional Climate Modeling, Climate Dynamics, Climate Variability and Changes, Climate Change Detection and\"", "[53] \"Attribution, Climate Projections, Climate Change Impacts, Science of Extreme Weather and Climate Events, Health, Agriculture, Water Resources and Energy, Aerosol-Cloud- Climate Interactions, Greenhouse Gas-Vegetation Interactions, Paleoclimate, Proxy Reconstructions, Abrupt Climate Change. Air Pollution: Urban Meteorology, Chemical Transport Modelling, Health Impact Assessment of Air Pollution, Greenhouse and Trace Gases Modelling. Centre for Automotive Research and Tribology [Code CTZ] EV Technologies (Power Train, charger, charging infrastructure,), Aircraft power system, Battery for EVs, Battery Management System, Thermal management of Battery, Autonomous and Connected Vehicle, Vehicle Telematics, Vehicle dynamics and control, Tribodynamics, Tribological and acoustical materials, Battery materials, Automotive NVH and condition monitoring. Centre for Biomedical Engineering [Code BMZ] Electrical/ Electronic/ Instrumentation Engineering; Mechanical/ Manufacturing/ Production Engineering; Chemistry/ Biochemistry/ Polymer Chemistry/ Material Sciences/ Pharmaceutical Sciences; Chemical Engineering; Mathematics/ Physics/ Bio-Physics; Computer Science Engineering; Biomedical Engineering; Biotechnology, MBBS/ BDS/ Homeopathy (B.H.M.S)/ Physiotherapy (BPT))/ Veterinary Sciences.  P a g e | 51 INFORMATION BROCHURE for\"", "[53] \"Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Centre for Rural Development and Technology [Code RDZ] Artisan technologies and rural industries; Water & sanitation; Rural housing & habitat; Traditional knowledge systems; Frugal innovation; Rural entrepreneurship; Design for sustainability; Rural energy system; Renewable energy technologies; Embodied energy & Carbon footprint; Biogas production & enrichment; Biofuels; Biofertilizers & biopesticides; Biomass production, Conversion & utilization; Environmental microbiology & bioremediation; Microbial Biochemistry and enzymology; Design and development of small farm tools and agricultural machines; Algal technologies; Natural products processing (food, medicinal, aromatic, & cosmeceutical plants); Applied secondary metabolites; Eco-friendly grain storage systems; Agro-food processing, storage & value addition; Food safety & quality measurement, 3D Printing of biological materials; Food biochemistry; Bio-formulation for food preservation & storage; Isolation, encapsulation & value addition of bioactives; Biomass thermochemical processing; Clean cookstoves; Solid & liquid waste management; Wastewater treatment; Wetland reclamation; Clean &\"", "[53] \"sustainable technologies; Natural fibre products; Environmental impact assessment; Tissue culture; Medicinal mushroom production technologies; Panchagavya – processes, validation & standards; Application of block chain technology; Nanotechnology & Nano toxicology in agriculture; Indigenous people (especially remote & peripheral communities) & development; Environment & sustainable development; PVTGs; Governance & governmentality studies; Andaman and Nicobar Islands, Leh-Ladakh, Jammu & Kashmir, and northeast India. Centre for Sensors, Instrumentation and Cyber-physical Systems Engineering [Code: IDZ] Sensors and Transducers; Electronic and optical sensors; Electronic Components and Circuits; Electronic circuit design (analog and digital); Electronic Techniques for Signal Conditioning and Interfacing; Signal and Image processing; CMOS analog and mixed signal circuits & systems for sensors; Optical Metrology; Micro-optics; Aspheric and freeform optics; Optical instrumentation; Holographic microscopy; Digital speckle pattern interferometry; Optical coherence tomography; Display Devices and Technology; Quantum optical devices; Integrated quantum technologies; Optical image processing; Machine Vision and Automation; Signal, Image and Video Processing Techniques for\"", "[54] \"Non-destructive Testing; Tera Hz, InfraRed, X-ray, and Ultrasound Imaging Modalities; Precision Measurement Systems; Precision mechanics; Instrumentation and Control; Instrument Design and Simulations; Mechatronics; Embedded systems; Sensors Systems; Smart Systems. National Resource Centre for Value Education in Engineering [NRZ] Holistic Health and Wellness. All issues pertaining to holistic view of individual’s health and wellness. These include modern scientific research on proven mind-body techniques for physical and mental health, such as Mindfulness, Yoga, Tai-Chi, Qi-Gong, Ayurveda, Holistic nutrition and others. Yogic Neuroscience, Indian Psychology, Cognitive Sciences, Clinical trials on Yoga and Ayurveda, fMRI-based Neuroimaging (fMRI), EEG, MEG, PET, fNIRS.  P a g e | 52 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Leadership for Sustainable Development. Various aspects of holistic and sustainable development. Notions of development which go beyond purely material well-being, and consider other aspects of human/societal well-being such as intellectual,\"", "[54] \"emotional and overall happiness. Notions of development which encompass sustained co-existence among human beings as well as with nature. How to create leadership (in various walks of life – especially in engineering/technology) for taking forward these alternate views on development. Inner Development. Understanding first person mental phenomena, especially those pertaining to Meditation, Mindfulness and Contemplation in a rigorous academic framework. Theoretical frameworks for alternative worldview based on deep contemplative insights. Teaching and research on first person mental phenomena through accurate and reproducible observations. Inner and Outer Harmony through Music and Arts. Classical music, dance and art forms that promote introspection, concentration, various aspects of self-awareness and devotion. Evolution of parallel streams of classical music in India. Development of classical art forms through folk art forms. Societal awareness through classical music. Streams of thought in classical music. Connections between 32ufism32c music and 32ufism. Technology-based analysis and dissemination of music. Value Education\"", "[54] \"and Technology. Teaching the teachers, tools and techniques for inculcating value education to students, especially at tertiary level of science and engineering. Research on effectiveness of various techniques for value education. Newer models of education. Use of technology for large scale dissemination of knowledge. Transportation Research & Injury Prevention Centre [Code TRZ] Transportation Planning; Traffic flow modeling and optimization, public transport systems; Sustainable Urban Transport; Travel Behaviour Modeling; Pedestrian Dynamics and Evacuations; Construction Safety and Work Zone Safety; Highway Safety; Vehicle Crash Modeling; Road Traffic Injury Prevention; Human Body Modeling and injury estimation; Pedestrian and non-motorized vehicle safety; Urban Freight, Road accident costing. Optics & Photonics Centre [Code OPZ] The newly established Optics and Photonics Centre aims to foster an interdisciplinary environment where students and researchers with diverse backgrounds will explore new frontiers in Optics and Photonics with equal emphasis on fundamentals as well as device development. Research topics of\"", "[55] \"the Centre are in areas of Optical Engineering, Optical Instrumentation and Metrology, Optical Imaging, Fiber Optics, Integrated Optics, Optical Sensors, Laser Science and Technology, Ultrafast Optics, Silicon Photonics, Nanophotonics, Plasmonics, Biophotonics, Green Photonics, Statistical and Quantum Optics, Quantum Photonics, Terahertz Photonics, Optical Metamaterials, Nonlinear Optics, Optical and Magneto-optical Storage Devices, Photonic Devices, and other relevant areas.  P a g e | 53 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI School of Artificial Intelligence [Code AIZ] Artificial Intelligence and related applications include but not limited to Machine Learning (deep learning, reinforcement learning, probabilistic modelling, generative models, neuro- symbolic machine learning), Data Mining (graph mining, information retrieval, intelligent query processing, knowledge graphs), Computer Vision and its applications (medical Imaging, perception of mobility, etc), Natural Language Processing and related applications (machine translation, dialog systems, summarization, etc.), AI & Robotics (planning, learning, human-interaction, embodied\"", "[55] \"systems, multi-agent systems), Mathematical foundations of AI, Ethics of AI, AI on the edge, and Applications of AI to domain areas such as healthcare, agriculture, education, industry 4.0, etc. Amar Nath and Shashi Khosla School of Information Technology [Code ANZ] Scalable & Dependable Computing, Information Security, Biometrics, Information Storage and Retrieval, Data Analytics, Social Network Analysis, High Speed Networks, Sensor Networks, Mobile and Web Based Computing, Multimedia Systems, Embedded Systems, VLSI Design Automation, Internet of Things, Image Processing, Computer Vision, Robotics and Intelligent Systems, Medical Applications of IT, Computational and Systems Biology, Computational Neuroscience and Neuroimaging, Assistive Technologies, Human Computer Interfaces, Information and Communication Technologies for Development, Data Science for Development, Computational Sustainability, Geographical Information Systems, Blockchain Technologies, Location Based Services, Other areas aligned with school activities. Bharti School of Telecommunication Technology and Management [Code BSZ] Telecom Networks, Telecom Software, Wireless Technologies, Optical Networks, Signal Processing, Telecom Systems Design, Planning\"", "[56] \"and Management, Regulatory and Policy Aspects of Telecom Services and Systems, Embedded Telecom Systems, Telecom Network Management, Performance Analysis of Communication System and Resource Management, Wireless Security, Machine learning for wireless communication, Internet of Things. School of Interdisciplinary Research [Code SRZ] IITD faculty from two or more different Depatments/Centres/Schools define Interdisciplinary Research problems as projects. The student selection is done for specific projects advertised periodically on the School website (https://sire.iitd.ac.in/); the student is supervised by all the concerned faculty.  P a g e | 54 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI School of Public Policy [Code PPZ] Energy and Environment, Agriculture, Food and Water, Internet, Digital Information and Society, Innovation Systems and Processes, Industry and Economy, Technical Higher Education, Sustainable Habitats. Candidates must refer to the School website (http://spp.iitd.ac.in/academic) for details. Kusuma School of Biological Sciences [Code BLZ] Computational\"", "[57] \"Biology, Systems Biology, Chemical Biology, Cellu lar Biophysics, protein folding & misfolding with focus on infectious diseases and non- communicable disorders, Chaperone assisted protein folding, Molecular biophysics of protein folding, unfolding and conformational properties, Cognitive and computational neuroscience, Viral diseases, Nanoparticle-based targeting, Structural Biology, Diagnostic Virology, Cancer Biology, Plant-based therapeutics, Marine Bioprospecting, insulin signaling and insulin resistant diabetes, Leishmaniasis, ion channel and receptor biology, Host pathogen interaction.  P a g e | 55 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI ANNEXURE-II M.TECH., M.S.(Research), M.DES., MPP, AND M.SC. PROGRAMMES OFFERED The Institute M.S. (Research) programme offered by following Departments/Centres/Schools: Department/Centre/School Programme Programme Code [A] M. Tech. Programmes of Deptts./Centre/ School Applied Mechanics Engineering Analysis and Design AMA Applied Research in Electronics Radio Frequency Design and Technology CRF Artificial Intelligence Machine Intelligence and Data Science AIB Automotive Research & Tribology Electric Mobility\"", "[58] \"CTE Atmospheric Science Atmospheric-Oceanic Science & Technology Biomedical Engineering AST Biomedical Engineering Biomedical Engineering BMT* Chemistry Molecular Engineering; Chemical Synthesis and Analysis CYM Chemical Engineering Chemical Engineering CHE Civil Engineering Construction Engg. & Management CET Environmental Engineering and Management CEV Geotechnical and Geoenvironmental Engineering CEG Rock Engineering and Underground Structures CEU Structural Engineering CES Transportation Engineering CEP Water Resources Engineering CEW * For M. Tech. in Biomedical Engineering, the eligibility criteria for bachelors in medicine, dental sciences, veterinary sciences, and pharmacy shall be either GATE (if available) or other GATE equivalent national examinations. In other disciplines (Engineering subjects), requirement of a GATE score shall be as per institute norms.  P a g e | 56 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Computer Science and Engineering Computer Science and Engineering MCS* Electrical Engineering Communications Engineering EEE Computer Technology EET Control\"", "[58] \"& Automation EEA Integrated Electronics & Circuits EEN Power Electronics, Electrical Machines & Drives EEP Power Systems EES Energy Science and Engineering Energy & Environment Technology and Management ESN Renewable Energy Technologies and Management ESR Materials Science and Engineering Materials Engineering MSM Polymer Science & Technology MSP Mechanical Engineering Mechanical Design MEM Industrial Engineering MEE Production Engineering MEP Thermal Engineering MET Physics Applied Optics PHA Solid State Materials PHM Textile and Fibre Engineering Fibre Science & Technology TTF Textile Engineering TTE Textile Chemical Processing TTC [B] Interdisciplinary M. Tech. Programmes M. Tech. Programmes Energy Studies JES Instrument Technology JID Opto-Electronics & Optical Communication JOP * Admission to M. Tech. and M.S. (Research) Programme in Computer Science and Engineering (MCS) is limited to candidates having a Qualifying degree in Computer Science and Engineering, Electrical Engineering, Information Technology, M.Sc. Operations Research/Statics, Electronic and Communication, M.Sc. M.A/M.Sc. Math, M.Sc. Math (with exposure to\"", "[59] \"appropriate level course in Computer Science) and MCA (with Math and Science at B.Sc. level). In addition to the above, both the programmes (MCS and CSY) are limited to candidates who have appeared in GATE with Computer Science and Engineering or Information Technology  P a g e | 57 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Telecom Technology & Management JTM VLSI Design Tools & Technology JVL* Cyber Security JCS [C] M.S. (Research) Applied Mechanics AMY Biochemical Engg. & Biotechnology BEY Civil Engineering CEY Chemical Engineering CHY Computer Science and Engineering CSY† Electrical Engineering EEY‡ Energy Science and Engineering ESY Materials Science and Engineering MSY Mechanical Engineering MEY Information Technology SIY Telecommunication Technology and Management BSY Biological Sciences BLY Automotive Research and Tribology CTY Machine Intelligence & Data Science AIY VLSI Design Tools & Technology JVY Sensors, Instrumentation and Cyber-\"", "[59] \"physical Systems Engineering IDY [D] M. Des. Programme Design Industrial Design DDS * M. Tech. programme in VLSI Design Tools and Technology is an interdisciplinary programme jointly offered by Electrical Engg. Deptt., Computer Science and Engineering Department & Centre for Applied Research in Electronics. The M. Tech. programme is wholly sponsored by industries such as Texas Instruments, Cadence Design Systems, Cypress Semiconductors and Qualcomm. The students will get a monthly fellowship as per rules. Candidate applying for admission to this programme should have basic degree in Computer Science (B.Tech. or equivalent) or Electrical Engineering (B.Tech. or equivalent) or Physics with electronics specialization (M.Sc. or equivalent) plus GATE. † Admission to M. Tech. and M.S. (Research) Programme in Computer Science and Engineering (MCS) is limited to candidates having a Qualifying degree in Computer Science and Engineering, Electrical Engineering, Information Technology, M.Sc. Operations Research/Statics, Electronic and Communication, M.Sc. M.A/M.Sc. Math, M.Sc. Math\"", "[61] \"(with exposure to appropriate level course in Computer Science) and MCA (with Math and Science at B.Sc. level). In addition to the above, both the programmes (MCS and CSY) are limited to candidates who have appeared in GATE with Computer Science and Engineering or Information Technology. ‡ Applicants to EEY (MS (Research)) program must have a minimum of four-year education after 12th standard with degree in science, engineering, or medicine (B. Tech./M. Sc./BE/BS/MBBS) or equivalent.  P a g e | 58 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI [E] M. Sc. Programme Humanities & Social Sciences Cognitive Science HCS [F] M.P.P. Programme Public Policy Master of Public Policy MPP  P a g e | 59 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI ANNEXURE-III OPTIONS FOR M. TECH., M.S. (RESEARCH) &\"", "[61] \"M.DES. PROGRAMMES ACCORDING TO THE DISCIPLINE IN WHICH THE CANDIDATE HOLDS THE QUALIFYING DEGREE Programme Code (As defined in Annexure-II) Disciplines of Qualifying Degree AIB Four Year B.Tech. / B.E. Degree (first class) or any equivalent degree (e.g., a four-year B.S. from a foreign university) from any Engineering or Science discipline. All GATE (Science and Engineering) Disciplines AIY Four Year B.Tech. / B.E. Degree (first class) or any equivalent degree (e.g., a four-year B.S. from a foreign university) from any Engineering or Science discipline. All GATE (Science and Engineering) Disciplines AMA Aerospace Engineering, Chemical Engineering, Civil Engineering, Industrial Engineering, Mechanical Engineering, Mining, Materials Science & Engineering, Marine Engineering, Naval Architecture, Production Engineering AMY Aerospace Engineering, Chemical Engineering, Civil Engineering, Mechanical Engineering, Marine Engineering, Naval Architecture, Production Engineering AST B.E./B.Tech. Agricultural Engineering, Chemical Engineering, Civil Engineering, Environmental Engineering, Mechanical Engineering. Candidates having B.Tech./B.E. in other branches of engineering will be considered\"", "[62] \"only if they have appropriate experience in related areas of atmospheric and oceanic Sciences, meteorology, remote sensing, etc. OR M.Sc. Meteorology/ Atmospheric Sciences/ Oceanography, M.Sc. Physics/ Geo- Physics/ Marine Engineering/ Statistics/ Chemistry; M.A./ M.Sc. Maths, MCA, M.Sc. Environmental/Agricultural Sciences, M.Sc. Geo- Information/Remote sensing. Candidates with M.A./M.Sc./MCA qualifying degree in subjects other than Meteorology/ Atmospheric Sciences/ Oceanography are required to have taken both Maths and Physics at least at the undergraduate level. BEY Biochemical Engineering, Biochemistry, Biotechnology, Bioinformatics, Biophysics, Biosciences, Chemical Engineering, Chemistry, Environmental Engineering, Environmental Science, Food Science and Engineering, Food  P a g e | 60 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Technology, Genetics, Industrial Biotechnology, Life Sciences, Microbiology, Pharmaceutical Biotechnology BMT B.Tech. / B.E. in Biomedical, Chemical, Computer Science, Electrical, Electronics and communications, Instrumentation and Mechanical Engineering, Engineering Physics, Biochemical and Biotechnology engineering, Materials Science. OR M.Sc.\"", "[62] \"or equivalent in Biotechnology, Chemistry, Electronics, Materials Science, Mathematics, Polymer science and technology, Physics OR M.B.B.S/ B.D.S./ Bachelor in Veterinary Sciences / B. Pharm. (duration 4 years and more) BSY Computer Science/Computer Science & Engineering, Electronics & Communication, Information Technology, Instrumentation Engineering, M.Sc. Physics with specialization in Electronics, Electrical Engineering, M.Sc. (Maths) /Applied Mathematics, MCA, Engineering Physics and Mechanical Engineering. BLY Bachelor's or Master's degree in any Engineering discipline. OR Bachelor's (Four-year programme) or Master's degree in Chemistry, Physics, Mathematics or Life Sciences CEC Selection only jointly with L&T: Civil, Electrical, Mechanical CEG Civil Engineering CEP Architecture, Civil Engineering, Mechanical Engineering CES Civil Engineering CET Architecture, Civil Engineering CEU Civil Engineering, Mining Engineering CEV Biochemical Engineering/ Biotechnology, Chemical Engineering, Civil Engineering, Environmental Engineering CEW Agricultural Engineering, Civil Engineering CEY Civil Engineering EEA Aeronautical Engineering, Biochemical Engineering, Biomedical Engineering, Biotechnology, Chemical Engineering, Computer Science, Computer Science & Engineering, Electrical Engineering, Energy\"", "[63] \"Engineering, Electronics & Communication, Instrumentation Engineering, Mechanical Engineering Qualifying GATE Disciplines: AE (Aerospace Engineering), BM (Biomedical Engineering), BT (Biotechnology), CH (Chemical Engineering), CS (Computer Science and Information Technology) EC (Electronics and Communication Engineering), EE (Electrical Engineering), IN (Instrumentation  P a g e | 61 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI Engineering), ME (Mechanical Engineering) EEE Computer Science/Computer Science & Engineering, Electrical Engineering, Energy Engineering, Electronics & Communication EET Computer Science/Computer Science & Engineering, Electrical Engineering, Electronics & Communication, Informational Technology, Instrumentation Engineering, M.Sc. in Electronics. GATE Paper (Only CS and EC GATE Score will be considered for C. Tech.) EEN Computer Science/Computer Science & Engineering, Electrical Engineering, Energy Engineering, Electronics & Communication, Instrumentation Engineering, Informational Technology, Engineering Physics, M.Sc. Physics, M.Sc. Physics with specialization in Electronics EEP Computer Science / Computer Science & Engineering, Electrical Engineering, Energy Engineering, Electronics\"", "[63] \"& Communication, Instrumentation Engineering EES Computer Science / Computer Science & Engineering, Electrical Engineering, Energy Engineering EEY Computer Science / Computer Science & Engineering, Electrical Engineering, Engineering Physics, Informational Technology, Instrumentation Engineering, M.Sc. Physics with specialization in Electronics, Electronics & Communication ESN B.Tech./B.Engg. in Chemical Engineering, Electrical Engineering, Electrical & Electronics Engineering, Engineering Physics, Energy Engineering, Mechanical Engineering, M.Sc. in Physics, Applied Physics. ESR 4-year Bachelor’s Degree in Chemical Engineering, Electrical Engineering, Electrical & Electronics Engineering, Electronics and Instrumentation Engineering, Energy Engineering, Engineering Physics, Mechanical Engineering, Power Engineering, Masters Degree in Physics, Electronics and Applied Physics. ESY B. Tech./B.E. in Chemical Engineering, Electrical Engineering, Electrical and Electronics Engineering, Energy Engineering, Mechanical Engineering, Engineering Physics. M.Sc. in Physics, Applied Physics IDY Electrical Engineering, Engineering Physics, Instrumentation Engineering, Mechanical Engineering, M.Sc. Physics JES B.Tech./B. Engineering in Chemical Engineering, Electrical Engineering, Electrical& Electronics Engineering, Engineering Physics, Energy Engineering, Mechanical Engineering, M.Sc. in Physics,\"", "[64] \"Applied Physics. JID Engineering Physics, Instrumentation Engineering, Mechanical Engineering, M.Sc. Physics, Electronics and Communication / Telecom / Control Engineering, Computer Science/Computer Engineering  P a g e | 62 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI JOP Computer Science/Computer Science & Engineering, Electrical Engineering, Electronics & Communication, Engineering Physics, M.Sc. in Physics/ Electronics/ Electronic Sciences. JTM Computer Science/Computer Science & Engineering, Electronics & Communication, Instrumentation Engineering, M.Sc. Physics with specialization in Electronics, Electrical Engineering JVL Computer Science/Computer Science & Engineering, Electrical Engineering, Engineering Physics, Informational Technology, Instrumentation Engineering, M.Sc. Physics, M.Sc. Physics with specialization in Electronics JVY Computer Science/Computer Science & Engineering, Electronics & Communication, Instrumentation Engineering, M.Sc. Physics with specialization in Electronics, Electrical Engineering JCS Computer Science/Computer Science & Engineering, Electrical Engineering, Electronics & Communication Engineering, Informational Technology, M.A./M.Sc. Math, M.Sc. Mathematics, M.Sc. in Computer Science or equivalent MCS Computer\"", "[64] \"Science & Engineering, Electrical Engineering, Information Technology, M.Sc. Operations Research / Statistics, Electronic and Communication, M.Sc. M.A./M.Sc. Math, M.Sc. Math (with exposure to appropriate level course in Computer Science) and MCA (with Math and Science at B.Sc. level) MEM Aeronautical Engineering, Agricultural Engineering, Automobile Engineering, Instrumentation Engineering, Mechanical Engineering, Metallurgy, Mining Engineering, Marine Engineering, Naval Architecture, Production Engineering, Textile Engineering/Technology MEE Aeronautical Engineering, Agricultural Engineering, Automobile Engineering, Biochemical Engineering/Biotechnology, Chemical Engineering, Civil Engineering, Computer Science/Computer Science & Engineering, Electrical Engineering, Food Engineering Technology, Industrial Engineering, Informational Technology, Instrumentation Engineering, Mechanical Engineering, Metallurgy, Mining Engineering, M.Sc. Operations Research, Manufacturing Science & Engineering, M.Sc. Statistics, M.A./M.Sc. Maths, M.Sc. Mathematics/with an exposure to appropriate level course-in Computer Technology, MCA (With Maths and Science at B.Sc. level), Production Engineering, Textile Engineering /Technology, Electronics & Communication MET Architecture, Aeronautical Engineering, Automobile Engineering, Chemical Engineering, Environmental Engineering, Food Engineering Technology, Mechanical Engineering, Metallurgy, Marine Engineering, Production\"", "[65] \"Engineering  P a g e | 63 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI MEP Aeronautical Engineering, Agricultural Engineering, Automobile Engineering, Industrial Engineering, Mechanical Engineering, Metallurgy, Manufacturing Science & Engineering, Polymer and Rubber Technology, Production Engineering, Textile Engineering/Technology, B.Tech. in Tool Design MEY Industrial Engineering, Mechanical Engineering, Manufacturing Science & Engineering, Production Engineering MSM B.Tech. in Materials Engineering, Metallurgical Engineering, Ceramic Engineering, Mechanical Engineering, B.Tech. in Engineering Physics, MSc in Physics, B.Tech./MSc in Materials Science & Engineering MSP Chemical Engineering, Engineering Physics, Industrial Engineering, Mechanical Engineering, M.Sc. Physics, M.Sc. Chemistry, Polymer and Rubber Technology, Textile Chemistry, Fibre Science and Technology, Textile Technology, Nanoscience and Nanotechnology, Petroleum Engineering, M.Sc. Polymer Science, M.Sc. Material Science and Engineering, M.Sc. Material Science MSY B.Tech. in Materials Engineering, Metallurgical Engineering, Ceramic Engineering, Mechanical Engineering, M.Sc. Physics, M.Sc. Materials Science, B.Tech./M.Sc. in Polymers. PHA Electrical Engineering,\"", "[66] \"Electronics & Communication, Engineering Physics, M.Sc. Physics, M.Sc. Physics with specialization in Electronics, Mechanical Engineering PHM Electrical Engineering, Electronics & Communication, Engineering Physics, M.Sc. Physics, M.Sc. Physics with specialization in Electronics, SIY Civil Engineering, Computer Science/Computer Science & Engineering, Electrical Engineering, Electronics & Communication, Engineering Physics, Energy Engineering / Energy System/Associated Disciplines, Industrial Design, Industrial Engineering, Information Technology, Instrumentation Engineering, Mechanical Engineering, M.Sc. Operations Research, Manufacturing Science & Engineering, M. Sc. Statistics, M.A./M. Sc. Maths, MCA (with Maths and Science at B.Sc. Level), M.Sc. Physics with specialization in Electronics, Production Engineering, And other engineering disciplines aligned with school activities. TTC Biochemical Engineering/Biotechnology, Chemical Engineering, Engineering Physics, Polymer and Rubber Technology, Textile Chemistry, Textile Engineering / Technology, Material Science, M.Sc. Physics and M.Sc. Chemistry TTE Mechanical Engineering, Manufacturing Science & Engineering, Production Engineering, Textile Engineering /Technology, Apparel Tech.  P a g e | 64 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R),\"", "[67] \"M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI TTF Biochemical Engineering / Biotechnology, Chemical Engineering, Polymer and Rubber Technology, Textile Chemistry, Textile Engineering/ Technology, Material Science, M.Sc. Physics and M.Sc. Chemistry  P a g e | 65 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI ANNEXURE-IV GATE SCORE CUT OFF* FOR ADMISSION TO NON-SPONSORED FULL-TIME M.TECH. PROGRAMMES IN ACADEMIC YEAR 2021-2022 (This is only for reference as the cut off* this year may change substantially) S.NO. M.Tech. Programme Code GATE Paper/ B.Tech. Discipline GEN EWS OBC SC ST PH 1 Engineering Analysis and Design AMA All 700 700 650 450 450 450 2 Biomedical Engineering BMT M.Sc. Biotech 650 650 617 585 585 585 B.E./B.Tech Biotech/Other 650 650 617 585 585 585 3 Radio Frequency Design & Technology CRF ECE 727 727 655 449 300 300 4 Atmospheric-Oceanic Science\"", "[67] \"Technology AST AG/AE/CE/CH/ES/ME/MN /PI/XE 700 675 675 450 450 450 XE with paper H 350 325 325 275 275 275 Other Engg. 700 675 675 450 450 450 CY/PH/MA/GG/ST 400 350 350 275 275 275 5 Molecular Engg; Chemical Synthesis and Analysis CYM CY 425 425 382 339 339 339 6 Chemical Engineering CHE Direct Admission 600 600 550 450 375 375 7 Construction Engg. & Mgmt. CET CE 600 600 600 350 350 350 8 Environmental Engg. & Mgmt. CEV CE 600 600 600 350 350 350 9 Rock Engg. & Underground Structure CEU CE 600 600 600 350 350 350 10 Geotechnical and Geoenvironmental Engg. CEG CE 600 600 600 350 350 350 11 Structural Engineering CES CE 600 600 600 350 350 350 12 Water Resources Engg. CEW CE 600 600 600 350 350 350 13 Transportation Engg. CEP CE 600 600 600 350 350 350 14\"", "[68] \"Computer Sc. & Engg. MCS CS/IT 800 800 720 550 550 550 15 Communications Engg. EEE EC 731 731 655 498 460 500 * As per shortlisting criteria  P a g e | 66 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI EE 819 816 800 770 720 600 16 Computer Technology EET IT/CS/EC/EE Other 740 735 666 485 385 340 17 Control & Automation EEA EE/EC/ Others 800 800 780 635 560 560 18 Integrated Electronics & Circuits EEN EC 900 860 850 640 600 500 EE 920 870 870 640 600 500 IN 860 830 830 590 590 500 PH 450 440 440 380 350 350 19 Power Electronics, Electrical Machines & Drives EEP EE 760 755 750 640 585 350 Other 900 880 850 700 650 350 20 Power Systems EES EE 750 720 680 600 600 600\"", "[68] \"Others 950 950 950 920 920 800 21 Mechanical Design MEM ME 725 725 675 525 375 375 22 Industrial Engineering MEE ME 725 725 675 525 375 375 23 Production Engineering MEP ME 725 725 675 525 375 375 24 Thermal Engineering MET ME 725 725 675 525 375 375 25 Material Sci. & Engg. MSM Meta. Engg 425 425 425 350 350 350 Mech. Engg 675 675 675 600 600 600 26 Applied Optics PHA PH 400 400 360 270 270 270 EE/EC 700 700 630 455 455 455 27 Solid State Materials PHM PH 400 400 360 270 270 270 EE/EC 700 700 630 455 455 455 28 Textile Engineering TTE BE/B.Tech. 690 690 621 460 460 460 29 Fibre Science & Tech. TTF BE/B.Tech. 650 650 585 433 433 433 30 Textile Chemical Processing TTC BE/B.Tech. 650 650 585 433 433 433 31 Energy Studies JES\"", "[69] \"BE/B.Tech./M.Sc 600 600 600 300 300 300 32 Energy & Environment Technologies and Mngt ESN BE/B.Tech./M.Sc. 600 600 600 300 300 300 33 Instrument Technology JID EE/TCE/Control 675 620 620 450 450 450 ME 620 570 570 425 425 425 PH 450 425 425 400 400 400 34 Optoelectronics & Optical Communication JOP EE/EC 715 695 650 490 490 440 PH 400 400 360 270 270 270 35 Polymer Science & Tech. MSP CY/PH/Polymer 350 350 350 280 280 280 TF 600 600 600 480 480 480  P a g e | 67 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI MSE 425 425 425 340 340 340 CH 550 550 550 440 440 440 ME 675 675 675 540 540 540 36 Telecom. Tech & Mgmt. JTM (All) 670 670 630 490 320 310 37 Cyber Security JCS EE/EC/MA/CS 700\"", "[70] \"700 650 550 500 500 38 VLSI Tool Design & Technology JVL EC 830 830 830 730 730 730 EE 830 830 830 730 730 730 CS 700 700 700 600 600 600 IN 930 930 930 800 830 830 Others 930 930 930 800 800 800 39 Electric Mobility CTE ME 730 730 675 525 525 525 EE 700 700 650 525 525 525 40 Industrial Design (M.Des.) DDS* B.Des./B.Arch./B.Plan./B.E ./B. Tech./B.F.A. or B.V.A. of Four years duration 48 31 39 38 31 24 Note: PH and IN scores are also admissible w.e.f. 2020-21. * CEED Percentile  P a g e | 68 INFORMATION BROCHURE for Ph.D., M.Tech., M.S.(R), M.Des., M.P.P., and M.Sc. Admissions Sem II l IIT DELHI ADDITIONAL IMPORTANT INFORMATION FOR CANDIDATES  Ragging in any form is banned in IIT Delhi.  The Institute treats ragging as a cognizable offence and stern action will be\"", "[70] \"taken against the offenders.  IIT Delhi will not be responsible for any postal delays.  All matters of disputes will be subject to legal jurisdictions of the courts in Delhi only.  The Institute reserves the right to amend, without any notice, any provisions stated in this brochure.\""]